{
  "venue_name": "Friends and Lovers",
  "extraction_timestamp": "20250702_201415",
  "raw_data": [
    {
      "eventDate": "Wednesday, July 2, 2025",
      "startTime": "8:00 PM",
      "endTime": "11:00 PM",
      "title": "Crown Heights Social Club: Live Jazz",
      "description": "Warm things up Wednesday at 641 Classon Avenue for the Crown Heights Social Club complete with live Jazz hosted Jon Boutellier and Keyed Up. Keep it cozy with $8 classic cocktails, quality company, and entertainment from 8pm to 11pm!Free Admission"
    },
    {
      "eventDate": "Thursday, July 3, 2025",
      "startTime": "7:30 PM",
      "endTime": "9:30 PM",
      "title": "Music League: IRL (Game Night)",
      "description": "Share your favorite music, listen to new artists, and compete to win in Music League: IRL, the perfect combination of music discovery and competition. So pull up, show off your music knowledge, and WIN PRIZES! It’s all happening Friday, June 5th, with your favorite friends, comics, djs, and other figures in nightlife.Free w/ RSVPALL SALES FINALRSVP"
    },
    {
      "eventDate": "Thu, Jul 3, 2025",
      "title": "FRIED DYNAMITE: A Soulful Dance Party",
      "description": "Thursday , June 26th, get right with Fried Dynamite and cool down cuz we’re serving up $8 classic cocktails all night long!Kick it like karate with the crew our as we hold you down on the dancefloor until 2AM with special guests playing the latest and greatest Rare Groove, Soul, Funk, Disco,  Hip-Hop, and more  with Blacktastic MC,Specks “Funky” Johnson, and drinks by CAM!Featuring residents:Run P., andTrevor BanksFree Admission w/ RSVP**=No RequestsRSVP"
    },
    {
      "eventDate": "Friday, July 4, 2025",
      "startTime": "7:00 PM",
      "endTime": "9:30 PM",
      "title": "Classique: Matinee KickBack (July 4th Edition)",
      "description": "This Thursday, kick back, grab a few, while we celebrate Juneteenth. Come carry on tradition alongside friends and fam alike with and $8 classic cocktails for all to enjoy our happiest of hours this July 4th.So come kick back at FnL with classic music, material, sprits, and more!$8 classic cocktails"
    },
    {
      "eventDate": "Fri, Jul 4, 2025",
      "title": "Str8 West Coastin’",
      "description": "Brooklyn's longest-running celebration of West Coast music and culture is back for another summer of sunshine-inflected beats and good vibes. Whether you're born and bred in the Bay like resident DJs Still Life and DJ Eleven, or you're NYC to bone with a serious appreciation for 2Pac, we've got you covered. California is a state of mind.$5 Early Bird Admission (Limited Supply)*$5 w/ RSVP before 11PM*$10 general admission before 12AM**=No RequestsAdmission (Early Bird + RSVP)"
    },
    {
      "eventDate": "Saturday, July 5, 2025",
      "startTime": "7:30 PM",
      "endTime": "9:30 PM",
      "title": "Feel the News w Marcela Onyango",
      "description": "Feel the Newsis a variety comedy show that also tells you how to feel about the news. After wowing zoomers all over on TikTok by giving them news with a sense of humour and anarchy, hostMarcela Onyangodecided to bring their strong feelings about the news IRL. During this very fun comedy variety hour, Marcela will humorously tell you how to feel about the news from an anarchist perspective while very funny comedians keep you laughing. In addition to very funny comedians, every month's show raises funds for direct action projects like mutual aid for people seeking asylum. So come laugh and support your community. You will leave the show more radical and more empowered, I promise.July’s lineup includesAlexandria LoveAtheer YacoubWinterLaura MerliWill PurpuraChristina BrownALL SALES FINALTickets"
    },
    {
      "eventDate": "Sat, Jul 5, 2025",
      "title": "Calling All Cancers: Hip-Hop, Disco, Soul, and more",
      "description": "Sat. July 5th get ready for our glorious birthday bash because we’re calling ALL CANCERS across the city at FnL as special guest Supes Base joins residentTajin lighting things up with heavy hitting heat and pristine vibes all night long. Expect School Hip-Hop, Soulful House, Global Rhythms, New York City classics and more!$5 early bird admission* (limited supply)$10 general admission*$5 w/ proof of RSVP before 11pm**= NO REQUESTSRSVP"
    },
    {
      "eventDate": "Wednesday, July 9, 2025",
      "startTime": "7:30 PM",
      "endTime": "11:30 PM",
      "title": "Not Your Average Open Mic",
      "description": "Welcome to the second edition ofNot Your Average Open Mic—a night dedicated to raw talent, authentic connection, and unforgettable vibes. This month we're spotlighting Afrobeats, with a live performances alongside our host,David Foreign, showcasing a lineup of dynamic artists who embody the bold energy and expressive soul of the genre. Whether you're stepping on stage or soaking it all in from the crowd, this experience is all about amplifying creative voices and building community.RSVP"
    },
    {
      "eventDate": "Thu, Jul 10, 2025",
      "title": "The Rhythm Section feat. Dottie Womack",
      "description": "An exploration of drum, bass, and snare…feel the groove, let it move your waistline…the familiar, the unfamiliar, the b-sides, the classics…welcome to The Rhythm Section.RSVP"
    },
    {
      "eventDate": "Friday, July 11, 2025",
      "startTime": "7:30 PM",
      "endTime": "9:30 PM",
      "title": "Boyz in the Woods Comedy",
      "description": "A comedy show hosted by Tawanda Gona, Joshua Stokes, Kenice Mobley, and Kofi Thomas, Boyz in the Woods comedy brings you the best stand-up comics you’ve seen on HBO, SNL, Netflix, and more.Think you’re an expert on the latest pop culture news?Audience members at Boyz in the Woods can win free drinks at our shows by answering pop culture and hip-hop trivia questions in between comedian’s sets.July’s lineup TBAHostsTawanda GonaKenice MobleyJosh StokesKofi ThomasJoin us at Friends and Lovers, for great vibes and seasonal cocktails, along with world famous DJs to keep you moving and grooving after the show. Perfect for meetups, after work, birthdays, and big groups. Come laugh with us!And don't forget to follow us on Instagram@Boyzinthewoodsnyfor updates on more drink deals and special drop-in guests.All Sales FinalTICKETS"
    },
    {
      "eventDate": "Fri, Jul 11, 2025",
      "title": "Boogie Blind Presents: Easily feat. Sticky Dojah",
      "description": "Slide through Friday night , July 11th, and get right with top tier party starter and Uptown representative,DJ Boogie Blind, alongside special guestSticky Dojahfor “Easily”, a club night connecting nostalgic and new eras of the sounds that shaped the Big Apple whether it's Hip-Hop, Dancehall, Soul, or R&B.Pull up to Friends and Lovers and cut up for a night to remember at “Easily” with special guests alongside resident Boogie Blind from 10PM to 4AM every second Friday of the month.$10 general admission*$5 before 11PM w/ proof of RSVP*= No RequestsAll Sales FinalRSVPPhil Lembke, akaSticky Dojah, originally from Germany, is a DJ based in New York City. With over two decades of record-digging and Hip Hop as his foundation, his sets seamlessly blend a wide range of styles—from Soul, House, and Disco to Grooves and sounds from around the globe.His online mix videos have garnered millions of views on social media, inspiring vinyl enthusiasts from beginners to seasoned industry veterans. Known for his expertise with 7-inch vinyl, Sticky Dojah is one of the curators of “Touch of Classics,” a weekly all-vinyl event at the Darling Rooftop, and co-hosts the radio showRecords Before Renton Brooklyn’s iconic Lot Radio. Whether spinning all-vinyl sets or electronic club music, he delivers timeless classics while unearthing rare and unknown gems to energize any party with his funky, eclectic selections.Before moving to the U.S., Sticky Dojah played extensively across Europe and toured in Russia and Africa. He has shared stages with and performed for renowned artists such as Nils Frahm, Sergio Mendes, Q-Tip, Redman & Method Man, Nightmares on Wax, A Guy Called Gerald, Schoolly D, and more.A Red Bull Music Academy alumnus, Sticky Dojah has collaborated with global brands and institutions, including Google, Adidas, Universal, MoMA, the Goethe-Institut, Coca-Cola, Soho House, Institut Français, Edit 1, Nivea, and Diesel, among others.DJ Boogie Blind, is one of the most trusted and respected DJs in the industry today. As a Harlem representative, World Champion, and member of the pioneering X-Ecutioners DJ crew Boogie Blind has consistently served up NY’s true sound internationally for over two decades. Whether he’s rocking crowds for Coachella, NBA All Star Weekend, Montreux Jazz Fest, or the Espy Awards, Blind is always pushing the envelope in the booth with timeless Hip-hop, Funk, Dancehall, Disco, and House of yesterday and today."
    },
    {
      "eventDate": "Saturday, July 12, 2025",
      "startTime": "7:30 PM",
      "endTime": "9:30 PM",
      "title": "Discount Philosophy (Live Comedy)",
      "description": "Part thought-provoking, part foolish: Discount Philosophy gathers some of the brightest minds in comedy to discuss life's most pressing ideas—one joke at a time.What is the meaning of life? Are we alone in the universe? What's for dinner? Join host,Spencer Simpson, and a variety of talented comedians as they interrogate questions that have plagued humanity for ages. A comedy show where great humor is matched with great inquiry: Discount Philosophy asks you to come for the laughs but stay for the confusion. Or the drinks.Saturday’s lineup includesShaunak GodkhindiGeorge HaywardWhitney RobinsonTICKETS"
    },
    {
      "eventDate": "Sat, Jul 12, 2025",
      "title": "SHAKE!: Monk-One x DJ Prestige",
      "description": "Our longest running all vinyl dance party, SHAKE!, welcomes special guests every second Saturday showing all the love to 70s/80s NYC nightlife. Join residentsDJ PrestigeandMonk-Onealongside special guests as they combine high level talent with nostalgia for one of the defining eras of clubbing in the city that never sleeps!!Preview someaudible treats and party anthems here for SHAKE!via their regularly updated playlist.$10 general admission*$5 w/ proof of RSVP (before 11pm) **= No RequestsRSVPPreview Playlist"
    },
    {
      "eventDate": "Thursday, July 17, 2025",
      "startTime": "7:30 PM",
      "endTime": "9:30 PM",
      "title": "Hallelujah the Hills & Perennial (Live)",
      "description": "Boston's esteemed Hallelujah the Hills tour their epic, celebrated 52 song playing-cards project—DECK—and return to Brooklyn with phenomenal New England trio Perennial, known by many as one of the best live acts actively touring in modern day America. Join us for a one-two punch that will leave audiences happily stunned and clapping all the way to the exit doors.TICKETS"
    },
    {
      "eventDate": "Sat, Jul 19, 2025",
      "title": "Algo Riddim: Uproot Andy x Epic B",
      "description": "Come Bussa wine for Algo.Riddim powered by QUENCH in Crown Heights, BK as we ride for the people withEpic BandUproot Andytwo certified NY staples on the Latin and Dancehall scenes. They’ll be bringing all the smoke alongside special guests to serve up EXTRA large portions of West Indian, Afro-Latin, and African flavors from start to finish.Pull up Saturday June 21st from 10pm to late!Expect everything from cutting-edge to classic West Indian, Afro-Latin, and African music (Dembow, Afrobeat, Amapiano, Gqom, Dancehall, Reggaeton, Batida, Kuduro, and more).$10 general admission before 12AM*$5 early bird admission (limited supply)*$5 admission with proof of RSVP before 11pm ** = No RequestsRSVP"
    },
    {
      "eventDate": "Thursday, July 24, 2025",
      "startTime": "7:00 PM",
      "endTime": "9:30 PM",
      "title": "Open Decks: (USB Only)",
      "description": "Calling all USB (Rekordbox) deejays!Come throw it down and bring your biggest blends and cherished cuts for our open deck happy hour.It’s your time to shine so slide through with friends, fam, and then some to bring your flavor to the mix for all to hear, it’s open decks for DJs this $8 classic cocktail happy hour* from 7pmEquipment:XDJ1000MKII(2x) +DJM S91 Drink minimum to participate (Zero proof //Non-Alcholic options available)This event is for USB (Rekordbox) djsonly*RSVP"
    },
    {
      "eventDate": "Sat, Jul 26, 2025",
      "title": "QUENCH: More Bass More Soul More Dance",
      "description": "Saturday, July 26th,QUENCHreturns withRun P.at the helm for his monthly tribute to more bass, more soul, and more dance at Friends and Lovers. So slide thru to 641 Classon Ave. and join him alongside special guests as we celebrate Black club culture worldwide on one of BK’s most active dance floors. Nothing but healthy doses of rhythms familiar and unseen all night long!Whether it’s House, Club music, Afrobeat, Dancehall, Soul, Hip-Hop, or Techno there’s always more in store for this moisturized high energy night from 10PM to 4AM.$10 general admission before 12AM*$5 early bird admission (limited supply)*$5 w/ RSVP before 11PM**=No RequestsALL SALES FINALRSVP"
    },
    {
      "eventDate": "Friday, August 8, 2025",
      "startTime": "7:30 PM",
      "endTime": "9:30 PM",
      "title": "Boyz in the Woods Comedy",
      "description": "A comedy show hosted by Tawanda Gona, Joshua Stokes, Kenice Mobley, and Kofi Thomas, Boyz in the Woods comedy brings you the best stand-up comics you’ve seen on HBO, SNL, Netflix, and more.Think you’re an expert on the latest pop culture news?Audience members at Boyz in the Woods can win free drinks at our shows by answering pop culture and hip-hop trivia questions in between comedian’s sets.August’s lineup TBAHostsTawanda GonaKenice MobleyJosh StokesKofi ThomasJoin us at Friends and Lovers, for great vibes and seasonal cocktails, along with world famous DJs to keep you moving and grooving after the show. Perfect for meetups, after work, birthdays, and big groups. Come laugh with us!And don't forget to follow us on Instagram@Boyzinthewoodsnyfor updates on more drink deals and special drop-in guests.All Sales FinalTICKETS"
    },
    {
      "eventDate": "Saturday, August 9, 2025",
      "startTime": "7:30 PM",
      "endTime": "9:30 PM",
      "title": "Discount Philosophy (Live Comedy)",
      "description": "Part thought-provoking, part foolish: Discount Philosophy gathers some of the brightest minds in comedy to discuss life's most pressing ideas—one joke at a time.What is the meaning of life? Are we alone in the universe? What's for dinner? Join host,Spencer Simpson, and a variety of talented comedians as they interrogate questions that have plagued humanity for ages. A comedy show where great humor is matched with great inquiry: Discount Philosophy asks you to come for the laughs but stay for the confusion. Or the drinks.July’s lineup TBATICKETS"
    },
    {
      "eventDate": "Wednesday, August 13, 2025",
      "startTime": "7:30 PM",
      "endTime": "11:30 PM",
      "title": "Not Your Average Open Mic (Copy)",
      "description": "Welcome to the third edition ofNot Your Average Open Micat Friends and Lovers—a night dedicated to raw talent, authentic connection, and unforgettable vibes. This month we're spotlighting Afrobeats, with a live performances alongside our host,David Foreign, showcasing a lineup of dynamic artists who embody the bold energy and expressive soul of the genre. Whether you're stepping on stage or soaking it all in from the crowd, this experience is all about amplifying creative voices and building community.RSVP"
    },
    {
      "eventDate": "Saturday, June 28, 2025",
      "startTime": "7:30 PM",
      "endTime": "9:30 PM",
      "title": "Open To Work: An Unemployed Comedy Show",
      "description": "A hilarious comedy show about surviving Linked-In, layoffs, and late-stage capitalism. Featuring a line-up of comedians who have been there. Come get the corporate catharsis you need. Hosted byAmanda Melhuish(Reductress) andCat Montesi(Wolfpack).Saturday’s Lineup TBASheria MattisTina SiebenLili PujolRiylan MillsBridget FoleyTICKETS"
    },
    {
      "eventDate": "Fri, Jun 27, 2025",
      "title": "SAZONAO",
      "description": "Whether it’s Reggaeton, Afrobeat, Dembow, Pop, Dancehall, or Cumbia SAZONAO always got something spicy cooking up with resident DJ Woof at point. It’s time to run up all of the rhythms of the diaspora Friday, June 27th, at FnL with special guests from 10pm till 4AM.$10 general admission*$5 w/ RSVP before 11PM** =No RequestsRSVP"
    },
    {
      "eventDate": "Friday, June 27, 2025",
      "startTime": "7:30 PM",
      "endTime": "9:30 PM",
      "title": "Annie Hildebrand and Friends (Live Comedy)",
      "description": "Watch local standout comedians do their best set at the pleasure of oneAnnie Hildebrand, comedy czar of the evening. After each set, she'll give a thumbs up or thumbs down, gladiator style, to determine if that comedian is allowed to continue their comedy career, or if they must quit forever. In the middle of the show, these stakes are then passed over to the audience where those who choose to participate are thrown into the pop culture gauntlet, competing in a round of trivia. Winners get prizes and losers must quit trivia for the rest of their lives.June’s lineup includesBrittany CarneyAnna BiancoPatrick HastieDan TreadwayArielle DundasHosted By:Annie HildebrandTICKETS"
    },
    {
      "eventDate": "Wed, Jun 25, 2025",
      "title": "The Wednesday Get Down: DJ Practice + Friends",
      "description": "Get up and get down Wednesday, May 14th with DJ Practice and the homies at Friends and Lovers. Expect House, Disco, Funk, Afrobeat & more from 8pm until late!"
    },
    {
      "eventDate": "Friday, June 20, 2025",
      "startTime": "10:00 PM",
      "endTime": "11:00 PM",
      "title": "Cookout On Classon: A Juneteenth Weekend Celebration",
      "description": "Friday, June 20th, pull up and shake a leg at Friends and Lovers forCookout on Classon, our Juneteenth weekend celebration featuringDelaceiba, Just Dame, and friends all night long. Nothing but heat on deck from 10pm to 4am as we warm up for a beautiful Brooklyn summer full of cookout classics from Funk and Soul to Hip-Hop, R&B, and much much more!$5 w/ proof of RSVP before 11pm*$10 general admission**= No RequestsRSVP"
    },
    {
      "eventDate": "Friday, June 20, 2025",
      "startTime": "7:30 PM",
      "endTime": "9:30 PM",
      "title": "Awkward Sex...And The City",
      "description": "Awkward Sex is exactly what it sounds like: comedians reliving intimate tales about their sex life and breaking barriers about sex and dating.Hosted by Natalie Wall, the show pairs sexual inclusion with humor and sheds light on the awkward universal experience we all know and love.Awkward Sex is about taking taboo subjects and creating a safe space for people to feel seen and heard.From cocaine infused one night stands to IBS flare ups during cunnilingus, you and your friends will be hanging on to every word and excited to go out and have a sexual misadventure of your own.“Good sex is always good sex, but it takes a special person to turn bad sex into something amazing. And that’s where our New York comedian and podcaster Natalie Wall comes in.” -Philadelphia Gay News“The voyeur within will delight.” – Refinery29TICKETS"
    },
    {
      "eventDate": "Wednesday, June 18, 2025",
      "startTime": "8:00 PM",
      "endTime": "11:00 PM",
      "title": "Love Language: A Singles Dance Party for Women Who Love Women",
      "description": "Love Language: A Singles Dance Party for Women Who Love WomenJune 18th | 8PM–11PM📍 Friends and Lovers — 641 Classon Ave, Brooklyn🎧 With DJsPero Whatever$5 | RSVP Required✨Proceeds benefit the Immigrant Defense Project (IDP)Looking to meet someone who speaks your love language? Join us atLove Language— a dance party for ladies who love ladies, made especially for singles who want to vibe, flirt, and maybe find their next crush (or summer fling 👀).We'll have the music to move you, the room to make moves, and the community to hold you. Whether you're dancing solo or syncing steps with someone new, this night is for you.Spots are limited, so grab your ticket and RSVP now. Let’s make some sparks — and support immigrant rights while we’re at it. ❤️‍🔥RSVP"
    },
    {
      "eventDate": "Saturday, June 7, 2025",
      "startTime": "3:00 PM",
      "endTime": "6:00 PM",
      "title": "Family Biz: Groove Hard, Nap Later",
      "description": "Think of it as the ultimate dance party for people who love music and have kids. You don’t have to trade your groove for nap schedules—just bring the kids along.Groove hard, nap later.See you there!Hosted on yourfavoriteBrooklyn dance floor (the one where you’ve spent late nights with epic beats), this time it's all about the kidsandthe grown-ups who love them.Expect booty shaking favorites fromAli ColemanandMiss Alicia.We’ve got:Light snacksfor the little snackers (don’t worry, parents, we’ve got drinks for you too).A vibe that’ll have you saying: “Who needs a sitter when we’ve got this?”Friends and Lovers641 Classon Ave, Crown Heights BKRSVP"
    },
    {
      "eventDate": "Friday, June 6, 2025",
      "startTime": "7:30 PM",
      "endTime": "9:30 PM",
      "title": "Silly Time (Live Comedy)",
      "description": "SILLY TIME IS BACK!!! Friends of all improv “levels” are collaborating for one special night. CAN’T WAIT TO C U THERE!!Friday’s lineup includesAudrey FromsonErik MartiniAnne LimGracie HirschLindsey HinesAndy WardRima ParikhMr. CardboardTickets"
    },
    {
      "eventDate": "Thu, Jun 5, 2025",
      "title": "NQOMA",
      "description": "NQOMA is a party series by Umumaroon that celebrates the African & diasporic drum cultures moving dance music worldwide. From amapiano to batida, baile funk to GQOM, afrobeats to jersey club and more, NQOMA is guaranteed to shake the dancefloor and move bodies featuring some the city's finest selectas."
    },
    {
      "eventDate": "Friday, May 30, 2025",
      "startTime": "7:30 PM",
      "endTime": "9:30 PM",
      "title": "Ricardo Grilli Trio",
      "description": "Experience an unforgettable evening at Friends and Lovers in Brooklyn as the Ricardo Grilli Trio brings their electrifying fusion of modern jazz, rock, funk, and Brazilian rhythms to the stage. Led by guitarist Ricardo Grilli, a rising star in the jazz scene who has graced iconic venues such as Smalls Jazz Club, The Blue Note, and the 55 Bar, the trio delivers a dynamic performance that blends virtuosic improvisation with infectious grooves. Drawing inspiration from luminaries like John Scofield and Eric Krasno, Grilli's compositions and arrangements showcase his unique voice as a composer and guitarist. With a rich musical background that includes performances with artists like Chris Potter, Aaron Parks, and Joe Martin, this is a night of music you won't want to miss.TICKETS"
    },
    {
      "eventDate": "Wednesday, May 28, 2025",
      "startTime": "7:00 PM",
      "endTime": "9:30 PM",
      "title": "TAROT, TRUTH AND THE TURNING SEASON",
      "description": "Join us for an evening of tarot readings, uncovering truths, and embracing the changing seasons together!Tickets"
    },
    {
      "eventDate": "Sat, May 24, 2025",
      "title": "FNL All-Star Weekend (Sat.): feat. Getlive!, Boogie Blind, Taj, & Fried Dynamite",
      "description": "Saturday night we carry on tradition for Memorial day weekend and get on the good foot with classics you know and love across Soul, Hip-Hop, Funk, Dancehall, and more.So pull up and keep those hips in motion all night long with hostSpecks \"Funky\" Johnsonalongside djsTaj,Boogie Blind,Getlive!,Fried Dynamite, andspecial guestsfrom 10pm until late!!$10 General  Admission*Discounted Entry w/ RSVP before 11pm*= No RequestsRSVP"
    },
    {
      "eventDate": "Fri, May 23, 2025",
      "title": "FNL All-Star Weekend (Fri.): feat. Mitchfactorial, Dash Speaks, & JustDame",
      "description": "Extended weekend is approaching and we’re kicking things off on Friday with an extra special night full of fun, music, and mayhem alongside djsJustDame(Happy Birthday!),Mitchfactorial,Dash Speaks, andspecial guests!!So come through and celebrate the warm weather as we turn things up a notch with classics you know and love across Soul, Hip-Hop, Funk, Dancehall, and more!$10 General  Admission*$5 Early Bird Admission* (all night)Discounted Entry w/ RSVP before 11pm*= No RequestsRSVP"
    },
    {
      "eventDate": "Thursday, May 22, 2025",
      "startTime": "7:00 PM",
      "endTime": "9:00 PM",
      "title": "B.Y.O.V. (Bring Your Own Vinyl) Happy Hour",
      "description": "It’s Thursday, so let’s groove as we stay ahead and start the weekend early with our 8 dollar classic cocktails from open to close.Bring Your Own Vinyl during happy hour for us to play (one at a time please), and we’ll have a time with good friends, great cocktails, and even better music."
    },
    {
      "eventDate": "Saturday, May 17, 2025",
      "startTime": "7:00 PM",
      "endTime": "9:30 PM",
      "title": "Ben Pagano + Nico Fox + Fury Young (Live)",
      "description": "Join us at Friends and Lovers for an eclectic evening of soulful and ethereal music featuring local NYC songwritersBen Pagano,Nico Fox, andFury Young.Ben Pagano is a local singer-songwriter, pianist and actor. His music is a blend of jazz, pop, soul, funk and psychedelia whilst maintaining a cohesiveness that defines the sound. His work is critically acclaimed and has been covered in publications such as New Yorker Magazine, Deli Magazine, Impose, Tiny Mixtapes to name some. He is currently working on his fourth album which will be released later this year.listen -benpagano.bandcamp.comBrooklyn-based artist Nico Fox, known professionally as Real Clothes, blends melancholy Appalachian folk with industrial rhythms, creating a sound fans describe as \"haunted Sade\" and\"apocalypse pop.\" With four albums and numerous singles, including her latest, Undone by You, her music delves into themes of betrayal, revenge, and obsession.Beyond music, Fox is also a writer and the author of The Art of Transmutation, a poetry collection available in English and Haitian Kreyòl.Listen-https://realclothes.bandcamp.com/Fury Young is an artland rocker and surrealist rapper who grew up in downtown NYC in the 1990s. For years he has worked in music championing voices of other artists with FREER Records (formerly Die Jim Crow) - the first label in America for musicians in prison and formerly incarcerated. All the while, Fury was working on songs of his own that he never had time to finish or release. That changed in October 2023 with the debut of \"X Ray,\" Fury's first song on streaming. Fury will be releasing a full length album this summer.Listen -https://open.spotify.com/intl-es/artist/4VXTDaM4TCu8VRy8B6eCEOTickets"
    },
    {
      "eventDate": "Fri, May 16, 2025",
      "title": "Friday Night Flava: DJ Phantom x Delaceiba x DJ Kay Kay 47",
      "description": "Friday Night is overflowing with Flava May 16th withDelaceibaandDJ Phantom, alongside special guestDJ Kay Kay 47and moreall night long from 10PM until late as we rock through the latest and greatest danceworthy classics whether it’s Hip-Hop, R&B, Soul Dancehall, or R&B!So pull up on us with a friend or a lover in Crown Heights to experience a night in BK on a dancefloor you can trust.This is most definitely something you do not want to miss!$10 general admission*$5 early bird available (limited supply)$5 w/ RSVP before 11PM*=No RequestsALL SALES FINALRSVP"
    },
    {
      "eventDate": "Thu, May 15, 2025",
      "title": "Where You At?: A Night Dedicated to World Dance Music",
      "description": "LSJandSOUNDSBYGOreturn with another edition of @whereyouatradio this Thursday, May 15th!Pull up and move to the sounds ofglobal dance music— fromAmapianoandAfrobeatstoBaile Funkand beyond. The energy will be high, the rhythms nonstop.🎶 Free with RSVP⏰ Party starts at 10PMCome ready to dance!RSVP"
    },
    {
      "eventDate": "Wednesday, May 14, 2025",
      "startTime": "7:00 PM",
      "endTime": "9:30 PM",
      "title": "Craft and Sip at...Friends and Lovers",
      "description": "Do you love crafts? Really tasty drinks? Good company? On May 14th at 7pm, Friends and Lovers and Alijah Webb (@cutestcraftclub) will be hosting a craft event! We’ll be decorating ceramic trinket dishes with porcelain-specific paint markers. This is a fun way to create something that you’ve made yourself.All materials for the craft are included, drinks are separate. All you’ll need to do afterward is pop the dish in the oven to cure the paint.2 drink suggested minimum 🫶TICKETS"
    },
    {
      "eventDate": "Wednesday, May 7, 2025",
      "startTime": "7:00 PM",
      "endTime": "9:00 PM",
      "title": "Quickies: Singles Event",
      "description": "Welcome to the hottest NYC-based singles event! Hotties everywhere are calling this event \"better than hinge\".Quickies is a loosely structured speed dating/singles mixer aimed to help the lonely, sexy, slutty folks of NYC find someone for the rest of their lives (or at least one night).Quickies is queer friendly. Feel free to write your preferences on your name-tag so others can know what to expect when chatting with you.We are partnering with Friends and Lovers's JAZZ NIGHT to create an intimate evening that can continue past the length of the speed dating event. Live Jazz will be played in the front bar until late. This is the perfect opportunity to get to know your strongest connection a little bit more.DETAILS:Wednesday, April 2nd at 7PM. Doors open at 7. Speed dating starts at 7:30 PM promptly.21+ (It's at a bar...)PLEASE SIGN UP WITH YOUR LEGAL NAME AND HAVE AN ID TO SHOW AT THE DOOR.Mid-20s to Late 30sCapacity will be limited to 75 participants so make sure you and your hot friends RSVP.FYI:Please be respectful, communicative, and consensual. All a*sh*les will be removed for the safety and wellbeing of the participants.Refunds will not be issued on the day of the event.DISCLAIMER: By attending this event, you agree to being photographed for marketing materials. If you object, please let me know and we will try our best to not to post any photos or videos taken of you.TICKETS"
    },
    {
      "eventDate": "Mon, May 5, 2025",
      "title": "Boogie Blind Presents: Easily",
      "description": "Light things up Friday night , June 6th, on BK’s most trusted dance floor with top tier party starter and Uptown legend,DJ Boogie Blind, alongside special guestsfor “Easily”, a club night connecting nostalgic and new eras of the sounds that shaped the Big Apple whether it's Hip-Hop, Dancehall, Soul, or R&B.Pull up to Friends and Lovers and cut up for a night to remember at “Easily” with special guests alongside resident Boogie Blind from 10PM to 4AM every second Friday of the month.$10 general admission*$5 before 11PM w/ proof of RSVP*= No RequestsAll Sales FinalRSVPDJ Boogie Blind, is one of the most trusted and respected DJs in the industry today. As a Harlem representative, World Champion, and member of the pioneering X-Ecutioners DJ crew Boogie Blind has consistently served up NY’s true sound internationally for over two decades. Whether he’s rocking crowds for Coachella, NBA All Star Weekend, Montreux Jazz Fest, or the Espy Awards, Blind is always pushing the envelope in the booth with timeless Hip-hop, Funk, Dancehall, Disco, and House of yesterday and today."
    },
    {
      "eventDate": "Fri, May 2, 2025",
      "title": "Friday Night LIVE: Hip-Hop, Dancehall, R&B, and More",
      "description": "Friday Night is all the way LIVE with Getliive! and Baydriana at FnL May 2nd from 10PM until late as we shake the room with classics cuts from Hip-Hop and R&B to Dancehall, Soul and more!So pull up on us with a friend or a lover in Crown Heights, BK to experience a night on a dancefloor you can trust.This is most definitely something you do not want to miss!$10 general admission*$5 early bird tickets (limited supply)*$5 w/ RSVP before 11PM**=No RequestsALL SALES FINALRSVP"
    },
    {
      "eventDate": "Friday, April 25, 2025",
      "startTime": "7:30 PM",
      "endTime": "9:30 PM",
      "title": "Casa Mantequilla (Live)",
      "description": "Get ready to dance with Casa Mantequilla, a high-energy and cross-cultural New York band featuring musicians from America, Puerto Rico, Nigeria, Belgium, and Congo. We mix West African, Latin, and American beats, singing in multiple languages for an unforgettable concert experience. Don’t miss the rhythm, the energy, and the vibe!ALL SALES FINALTICKETS"
    },
    {
      "eventDate": "Friday, April 18, 2025",
      "startTime": "7:00 PM",
      "endTime": "9:30 PM",
      "title": "DJ Malachi (Happy Hour)",
      "description": "Friday April 18th join us at FnL for $8 classic cocktails with DJ Malachi Jean playing danceworthy classics for happy hour"
    },
    {
      "eventDate": "Thursday, April 10, 2025",
      "startTime": "7:30 PM",
      "endTime": "9:30 PM",
      "title": "Back Outdoors: Hundred in the Hand and Deer Lady",
      "description": "Join us Thursday April 10th for a live performance by Hundred in The Hand as they return to Brooklyn with support from Deer Lady.Hundred in The Hand is a band Based in the Dakotas fronted by vocalist, artist and activist Tokata Iron Eyes. A musical exercise in radical healing, and curious rage, serving as a sonic bridge between the stagnancy of traumas and the tenets of hope for a revolutionary future. The band is ever evolving and growing, co-creating with interchanging and intersecting artists across disciplines and the world.TICKETS"
    },
    {
      "eventDate": "Friday, April 4, 2025",
      "startTime": "7:00 PM",
      "endTime": "10:00 PM",
      "title": "Nightlife United Community Happy Hour + Dance Party: Hosted by Venus Cuffs",
      "description": "Nightlife United is celebrating 5 years of industry impact withVenus Cuffs! A trailblazer in nightlife and cultural organizing, Venus Cuffs has created space and visibility for QTBIPOC communities, carving out room for joy, resistance, and radical celebration. Join us this Friday for a very specialCommunity Happy Hour fundraiser—a night of connection, music, and purpose.Nightlife United is an industry resource and advocacy non-profit coalition established by and for the Nightlife community. The organization is raising funds for theNU Workforce Development programthat upskills future Nightlife leaders from under-recognized communities.You’ll be in the room with some of NYC’s most respected nightlife veterans—an amazing opportunity to network, ask questions, and soak up wisdom from the folks who’ve built and sustained this city's cultural backbone.Expect:Incredible musicA room full of colleagues, creatives, supporters—and YOUThe chance to support the future of nightlife while celebrating its legacyDJ set by a special guest DJ (if you FnL then you know it'll be good!)Come early, stay late, and celebrate five years of impact with us.RSVP"
    },
    {
      "eventDate": "Thursday, April 3, 2025",
      "startTime": "7:00 PM",
      "endTime": "11:00 PM",
      "title": "Bored of Dating Apps (Singles Only Dance Party)",
      "description": "It’s been two years of so much love, friendship, laughs, snogs, countless numbers exchanges, keys exchanged, friends' holidays planned and incredible connections have been formed. Whether it’s a romantic relationship or a pal for life, we’re so happy with what’s been happening atBODA.Our socials have been described as wholesome, great for single peoples' mental health and events which are so good they make you wanna stay single, so come for great vibes & lovely people.We're hosting this social at theultimate singles' party,Friends and Lovers,where guests can connect at the bar over cocktails or over on the dancefloor...About the venue:Friends and Lovers is a project of passion, friendship, and love. Our mission is to provide a safe space for all kinds of people to let loose, be themselves, dance, make friends, fall in love, and party their hearts out, and a stage for creatives of all types to push envelopes and pull heart strings.What to expect:- A room where everyone is single. That's one of the only rules we have - you must be single to enter in. This is our singles club. A space free of couples, families, kids etc, a place just for us to let our hair down and be with like-minded people.- A 'Dutch Courage' shot (totally optional, so don't worry if this isn't your thing) along with a BODA mindful icebreaker- Our community-feel events attract a room full of brilliant people who appreciate slower, healthier, kinder approach to dating over the fast & furious modern dating climate singles are up againstEssential need-to-know bits:- EVERYONE IS WELCOME, whatever your sexuality or gender - as long as you're over 21-We cannot control the level of ratios on the night (men to women, women to women, men to men etc), so please do bear this in mind when booking a ticket.We do however try very hard to get a great, wide mix of ages, genders and sexualities, as we want everyone to have a fantastic night- Feel free to ask us any questions through this or follow us on Instagram to get a feel for our socials :@boredofdatingapps*Because of the nature of this event, there are no refunds or transfers. Ticket holders can only sell ticket on if the person shares the same gender on the ticket*- By purchasing a ticket means you consent to BODA taking videos and pictures of the event to post on our social media pages.Our hosts can't wait to meet you! See you there for good times.TICKETS"
    },
    {
      "eventDate": "Friday, March 28, 2025",
      "startTime": "7:30 PM",
      "endTime": "9:30 PM",
      "title": "A Really Good Comedy Show",
      "description": "Stiff drinks, solid people, and A Really Good Comedy Show this Friday March 28th hosted by none other thanLilly Sparksfresh off a sold out February show!Lineup includesAmber SingletaryDarius DinkinsRufat AgayevHosted by:Lilly SparksTickets"
    },
    {
      "eventDate": "Wednesday, March 26, 2025",
      "startTime": "7:00 PM",
      "endTime": "9:30 PM",
      "title": "Soothsayer: A Comedy Open Mic",
      "description": "Unsure of the future, your love life, or your Wednesday evening plans? Fear not, for the oracle will answer all. Let the muses speak through you in a three minute set at this prophetic comedy open mic hosted by known seers Emily Villarreal and Adison Eyring. Come, weary traveler, to see the future (of comedy)!Sign Up: 7:00PM* (first come first serve in person)Start Time: 7:30PM**= Proof of Drink purchased required for participationRSVP"
    },
    {
      "eventDate": "Sat, Mar 22, 2025",
      "title": "FnL Presents: Baydriana x Iamnotmyhistory x A2Z",
      "description": "Show up and show out Sat. March 22nd with a²z, Baydriana, and Iamnotmyhistory  all night long from 10PM to 4AM as we rock through the latest and greatest danceworthy classics whether it’s Hip-Hop, R&B, Soul Dancehall, or R&B!So pull up on us with a friend or a lover in Crown Heights to experience a night in BK on a dancefloor you can trust.This is most definitely something you do not want to miss!$10 general admission*$5 early bird available (limited supply)$5 w/ RSVP before 11PM*=No RequestsALL SALES FINALRSVP"
    }
  ],
  "cleaned_events": [
    {
      "venue_name": "Friends and Lovers",
      "title": "Crown Heights Social Club: Live Jazz",
      "description": "Warm things up Wednesday at 641 Classon Avenue for the Crown Heights Social Club complete with live Jazz hosted Jon Boutellier and Keyed Up. Keep it cozy with $8 classic cocktails, quality company, and entertainment from 8pm to 11pm!Free Admission",
      "event_date": "2025-07-02",
      "start_time": "20:00",
      "end_time": null,
      "price": "N/A",
      "image": null,
      "url": null,
      "extraction_timestamp": "2025-07-02T20:14:15.195168"
    },
    {
      "venue_name": "Friends and Lovers",
      "title": "Music League: IRL (Game Night)",
      "description": "Share your favorite music, listen to new artists, and compete to win in Music League: IRL, the perfect combination of music discovery and competition. So pull up, show off your music knowledge, and WIN PRIZES! It’s all happening Friday, June 5th, with your favorite friends, comics, djs, and other figures in nightlife.Free w/ RSVPALL SALES FINALRSVP",
      "event_date": "2025-07-03",
      "start_time": "19:30",
      "end_time": null,
      "price": "N/A",
      "image": null,
      "url": null,
      "extraction_timestamp": "2025-07-02T20:14:15.199877"
    },
    {
      "venue_name": "Friends and Lovers",
      "title": "FRIED DYNAMITE: A Soulful Dance Party",
      "description": "Thursday , June 26th, get right with Fried Dynamite and cool down cuz we’re serving up $8 classic cocktails all night long!Kick it like karate with the crew our as we hold you down on the dancefloor until 2AM with special guests playing the latest and greatest Rare Groove, Soul, Funk, Disco,  Hip-Hop, and more  with Blacktastic MC,Specks “Funky” Johnson, and drinks by CAM!Featuring residents:Run P., andTrevor BanksFree Admission w/ RSVP**=No RequestsRSVP",
      "event_date": "2025-07-03",
      "start_time": null,
      "end_time": null,
      "price": "N/A",
      "image": null,
      "url": null,
      "extraction_timestamp": "2025-07-02T20:14:15.200282"
    },
    {
      "venue_name": "Friends and Lovers",
      "title": "Classique: Matinee KickBack (July 4th Edition)",
      "description": "This Thursday, kick back, grab a few, while we celebrate Juneteenth. Come carry on tradition alongside friends and fam alike with and $8 classic cocktails for all to enjoy our happiest of hours this July 4th.So come kick back at FnL with classic music, material, sprits, and more!$8 classic cocktails",
      "event_date": "2025-07-04",
      "start_time": "19:00",
      "end_time": null,
      "price": "N/A",
      "image": null,
      "url": null,
      "extraction_timestamp": "2025-07-02T20:14:15.200417"
    },
    {
      "venue_name": "Friends and Lovers",
      "title": "Str8 West Coastin’",
      "description": "Brooklyn's longest-running celebration of West Coast music and culture is back for another summer of sunshine-inflected beats and good vibes. Whether you're born and bred in the Bay like resident DJs Still Life and DJ Eleven, or you're NYC to bone with a serious appreciation for 2Pac, we've got you covered. California is a state of mind.$5 Early Bird Admission (Limited Supply)*$5 w/ RSVP before 11PM*$10 general admission before 12AM**=No RequestsAdmission (Early Bird + RSVP)",
      "event_date": "2025-07-04",
      "start_time": null,
      "end_time": null,
      "price": "N/A",
      "image": null,
      "url": null,
      "extraction_timestamp": "2025-07-02T20:14:15.200680"
    },
    {
      "venue_name": "Friends and Lovers",
      "title": "Feel the News w Marcela Onyango",
      "description": "Feel the Newsis a variety comedy show that also tells you how to feel about the news. After wowing zoomers all over on TikTok by giving them news with a sense of humour and anarchy, hostMarcela Onyangodecided to bring their strong feelings about the news IRL. During this very fun comedy variety hour, Marcela will humorously tell you how to feel about the news from an anarchist perspective while very funny comedians keep you laughing. In addition to very funny comedians, every month's show raises funds for direct action projects like mutual aid for people seeking asylum. So come laugh and support your community. You will leave the show more radical and more empowered, I promise.July’s lineup includesAlexandria LoveAtheer YacoubWinterLaura MerliWill PurpuraChristina BrownALL SALES FINALTickets",
      "event_date": "2025-07-05",
      "start_time": "19:30",
      "end_time": null,
      "price": "N/A",
      "image": null,
      "url": null,
      "extraction_timestamp": "2025-07-02T20:14:15.200810"
    },
    {
      "venue_name": "Friends and Lovers",
      "title": "Calling All Cancers: Hip-Hop, Disco, Soul, and more",
      "description": "Sat. July 5th get ready for our glorious birthday bash because we’re calling ALL CANCERS across the city at FnL as special guest Supes Base joins residentTajin lighting things up with heavy hitting heat and pristine vibes all night long. Expect School Hip-Hop, Soulful House, Global Rhythms, New York City classics and more!$5 early bird admission* (limited supply)$10 general admission*$5 w/ proof of RSVP before 11pm**= NO REQUESTSRSVP",
      "event_date": "2025-07-05",
      "start_time": null,
      "end_time": null,
      "price": "N/A",
      "image": null,
      "url": null,
      "extraction_timestamp": "2025-07-02T20:14:15.201069"
    },
    {
      "venue_name": "Friends and Lovers",
      "title": "Not Your Average Open Mic",
      "description": "Welcome to the second edition ofNot Your Average Open Mic—a night dedicated to raw talent, authentic connection, and unforgettable vibes. This month we're spotlighting Afrobeats, with a live performances alongside our host,David Foreign, showcasing a lineup of dynamic artists who embody the bold energy and expressive soul of the genre. Whether you're stepping on stage or soaking it all in from the crowd, this experience is all about amplifying creative voices and building community.RSVP",
      "event_date": "2025-07-09",
      "start_time": "19:30",
      "end_time": null,
      "price": "N/A",
      "image": null,
      "url": null,
      "extraction_timestamp": "2025-07-02T20:14:15.201197"
    },
    {
      "venue_name": "Friends and Lovers",
      "title": "The Rhythm Section feat. Dottie Womack",
      "description": "An exploration of drum, bass, and snare…feel the groove, let it move your waistline…the familiar, the unfamiliar, the b-sides, the classics…welcome to The Rhythm Section.RSVP",
      "event_date": "2025-07-10",
      "start_time": null,
      "end_time": null,
      "price": "N/A",
      "image": null,
      "url": null,
      "extraction_timestamp": "2025-07-02T20:14:15.201503"
    },
    {
      "venue_name": "Friends and Lovers",
      "title": "Boyz in the Woods Comedy",
      "description": "A comedy show hosted by Tawanda Gona, Joshua Stokes, Kenice Mobley, and Kofi Thomas, Boyz in the Woods comedy brings you the best stand-up comics you’ve seen on HBO, SNL, Netflix, and more.Think you’re an expert on the latest pop culture news?Audience members at Boyz in the Woods can win free drinks at our shows by answering pop culture and hip-hop trivia questions in between comedian’s sets.July’s lineup TBAHostsTawanda GonaKenice MobleyJosh StokesKofi ThomasJoin us at Friends and Lovers, for great vibes and seasonal cocktails, along with world famous DJs to keep you moving and grooving after the show. Perfect for meetups, after work, birthdays, and big groups. Come laugh with us!And don't forget to follow us on Instagram@Boyzinthewoodsnyfor updates on more drink deals and special drop-in guests.All Sales FinalTICKETS",
      "event_date": "2025-07-11",
      "start_time": "19:30",
      "end_time": null,
      "price": "N/A",
      "image": null,
      "url": null,
      "extraction_timestamp": "2025-07-02T20:14:15.201645"
    },
    {
      "venue_name": "Friends and Lovers",
      "title": "Boogie Blind Presents: Easily feat. Sticky Dojah",
      "description": "Slide through Friday night , July 11th, and get right with top tier party starter and Uptown representative,DJ Boogie Blind, alongside special guestSticky Dojahfor “Easily”, a club night connecting nostalgic and new eras of the sounds that shaped the Big Apple whether it's Hip-Hop, Dancehall, Soul, or R&B.Pull up to Friends and Lovers and cut up for a night to remember at “Easily” with special guests alongside resident Boogie Blind from 10PM to 4AM every second Friday of the month.$10 general admission*$5 before 11PM w/ proof of RSVP*= No RequestsAll Sales FinalRSVPPhil Lembke, akaSticky Dojah, originally from Germany, is a DJ based in New York City. With over two decades of record-digging and Hip Hop as his foundation, his sets seamlessly blend a wide range of styles—from Soul, House, and Disco to Grooves and sounds from around the globe.His online mix videos have garnered millions of views on social media, inspiring vinyl enthusiasts from beginners to seasoned industry veterans. Known for his expertise with 7-inch vinyl, Sticky Dojah is one of the curators of “Touch of Classics,” a weekly all-vinyl event at the Darling Rooftop, and co-hosts the radio showRecords Before Renton Brooklyn’s iconic Lot Radio. Whether spinning all-vinyl sets or electronic club music, he delivers timeless classics while unearthing rare and unknown gems to energize any party with his funky, eclectic selections.Before moving to the U.S., Sticky Dojah played extensively across Europe and toured in Russia and Africa. He has shared stages with and performed for renowned artists such as Nils Frahm, Sergio Mendes, Q-Tip, Redman & Method Man, Nightmares on Wax, A Guy Called Gerald, Schoolly D, and more.A Red Bull Music Academy alumnus, Sticky Dojah has collaborated with global brands and institutions, including Google, Adidas, Universal, MoMA, the Goethe-Institut, Coca-Cola, Soho House, Institut Français, Edit 1, Nivea, and Diesel, among others.DJ Boogie Blind, is one of the most trusted and respected DJs in the industry today. As a Harlem representative, World Champion, and member of the pioneering X-Ecutioners DJ crew Boogie Blind has consistently served up NY’s true sound internationally for over two decades. Whether he’s rocking crowds for Coachella, NBA All Star Weekend, Montreux Jazz Fest, or the Espy Awards, Blind is always pushing the envelope in the booth with timeless Hip-hop, Funk, Dancehall, Disco, and House of yesterday and today.",
      "event_date": "2025-07-11",
      "start_time": null,
      "end_time": null,
      "price": "N/A",
      "image": null,
      "url": null,
      "extraction_timestamp": "2025-07-02T20:14:15.201956"
    },
    {
      "venue_name": "Friends and Lovers",
      "title": "Discount Philosophy (Live Comedy)",
      "description": "Part thought-provoking, part foolish: Discount Philosophy gathers some of the brightest minds in comedy to discuss life's most pressing ideas—one joke at a time.What is the meaning of life? Are we alone in the universe? What's for dinner? Join host,Spencer Simpson, and a variety of talented comedians as they interrogate questions that have plagued humanity for ages. A comedy show where great humor is matched with great inquiry: Discount Philosophy asks you to come for the laughs but stay for the confusion. Or the drinks.Saturday’s lineup includesShaunak GodkhindiGeorge HaywardWhitney RobinsonTICKETS",
      "event_date": "2025-07-12",
      "start_time": "19:30",
      "end_time": null,
      "price": "N/A",
      "image": null,
      "url": null,
      "extraction_timestamp": "2025-07-02T20:14:15.202089"
    },
    {
      "venue_name": "Friends and Lovers",
      "title": "SHAKE!: Monk-One x DJ Prestige",
      "description": "Our longest running all vinyl dance party, SHAKE!, welcomes special guests every second Saturday showing all the love to 70s/80s NYC nightlife. Join residentsDJ PrestigeandMonk-Onealongside special guests as they combine high level talent with nostalgia for one of the defining eras of clubbing in the city that never sleeps!!Preview someaudible treats and party anthems here for SHAKE!via their regularly updated playlist.$10 general admission*$5 w/ proof of RSVP (before 11pm) **= No RequestsRSVPPreview Playlist",
      "event_date": "2025-07-12",
      "start_time": null,
      "end_time": null,
      "price": "N/A",
      "image": null,
      "url": null,
      "extraction_timestamp": "2025-07-02T20:14:15.202373"
    },
    {
      "venue_name": "Friends and Lovers",
      "title": "Hallelujah the Hills & Perennial (Live)",
      "description": "Boston's esteemed Hallelujah the Hills tour their epic, celebrated 52 song playing-cards project—DECK—and return to Brooklyn with phenomenal New England trio Perennial, known by many as one of the best live acts actively touring in modern day America. Join us for a one-two punch that will leave audiences happily stunned and clapping all the way to the exit doors.TICKETS",
      "event_date": "2025-07-17",
      "start_time": "19:30",
      "end_time": null,
      "price": "N/A",
      "image": null,
      "url": null,
      "extraction_timestamp": "2025-07-02T20:14:15.202511"
    },
    {
      "venue_name": "Friends and Lovers",
      "title": "Algo Riddim: Uproot Andy x Epic B",
      "description": "Come Bussa wine for Algo.Riddim powered by QUENCH in Crown Heights, BK as we ride for the people withEpic BandUproot Andytwo certified NY staples on the Latin and Dancehall scenes. They’ll be bringing all the smoke alongside special guests to serve up EXTRA large portions of West Indian, Afro-Latin, and African flavors from start to finish.Pull up Saturday June 21st from 10pm to late!Expect everything from cutting-edge to classic West Indian, Afro-Latin, and African music (Dembow, Afrobeat, Amapiano, Gqom, Dancehall, Reggaeton, Batida, Kuduro, and more).$10 general admission before 12AM*$5 early bird admission (limited supply)*$5 admission with proof of RSVP before 11pm ** = No RequestsRSVP",
      "event_date": "2025-07-19",
      "start_time": null,
      "end_time": null,
      "price": "N/A",
      "image": null,
      "url": null,
      "extraction_timestamp": "2025-07-02T20:14:15.202781"
    },
    {
      "venue_name": "Friends and Lovers",
      "title": "Open Decks: (USB Only)",
      "description": "Calling all USB (Rekordbox) deejays!Come throw it down and bring your biggest blends and cherished cuts for our open deck happy hour.It’s your time to shine so slide through with friends, fam, and then some to bring your flavor to the mix for all to hear, it’s open decks for DJs this $8 classic cocktail happy hour* from 7pmEquipment:XDJ1000MKII(2x) +DJM S91 Drink minimum to participate (Zero proof //Non-Alcholic options available)This event is for USB (Rekordbox) djsonly*RSVP",
      "event_date": "2025-07-24",
      "start_time": "19:00",
      "end_time": null,
      "price": "N/A",
      "image": null,
      "url": null,
      "extraction_timestamp": "2025-07-02T20:14:15.202917"
    },
    {
      "venue_name": "Friends and Lovers",
      "title": "QUENCH: More Bass More Soul More Dance",
      "description": "Saturday, July 26th,QUENCHreturns withRun P.at the helm for his monthly tribute to more bass, more soul, and more dance at Friends and Lovers. So slide thru to 641 Classon Ave. and join him alongside special guests as we celebrate Black club culture worldwide on one of BK’s most active dance floors. Nothing but healthy doses of rhythms familiar and unseen all night long!Whether it’s House, Club music, Afrobeat, Dancehall, Soul, Hip-Hop, or Techno there’s always more in store for this moisturized high energy night from 10PM to 4AM.$10 general admission before 12AM*$5 early bird admission (limited supply)*$5 w/ RSVP before 11PM**=No RequestsALL SALES FINALRSVP",
      "event_date": "2025-07-26",
      "start_time": null,
      "end_time": null,
      "price": "N/A",
      "image": null,
      "url": null,
      "extraction_timestamp": "2025-07-02T20:14:15.203205"
    },
    {
      "venue_name": "Friends and Lovers",
      "title": "Boyz in the Woods Comedy",
      "description": "A comedy show hosted by Tawanda Gona, Joshua Stokes, Kenice Mobley, and Kofi Thomas, Boyz in the Woods comedy brings you the best stand-up comics you’ve seen on HBO, SNL, Netflix, and more.Think you’re an expert on the latest pop culture news?Audience members at Boyz in the Woods can win free drinks at our shows by answering pop culture and hip-hop trivia questions in between comedian’s sets.August’s lineup TBAHostsTawanda GonaKenice MobleyJosh StokesKofi ThomasJoin us at Friends and Lovers, for great vibes and seasonal cocktails, along with world famous DJs to keep you moving and grooving after the show. Perfect for meetups, after work, birthdays, and big groups. Come laugh with us!And don't forget to follow us on Instagram@Boyzinthewoodsnyfor updates on more drink deals and special drop-in guests.All Sales FinalTICKETS",
      "event_date": "2025-08-08",
      "start_time": "19:30",
      "end_time": null,
      "price": "N/A",
      "image": null,
      "url": null,
      "extraction_timestamp": "2025-07-02T20:14:15.203395"
    },
    {
      "venue_name": "Friends and Lovers",
      "title": "Discount Philosophy (Live Comedy)",
      "description": "Part thought-provoking, part foolish: Discount Philosophy gathers some of the brightest minds in comedy to discuss life's most pressing ideas—one joke at a time.What is the meaning of life? Are we alone in the universe? What's for dinner? Join host,Spencer Simpson, and a variety of talented comedians as they interrogate questions that have plagued humanity for ages. A comedy show where great humor is matched with great inquiry: Discount Philosophy asks you to come for the laughs but stay for the confusion. Or the drinks.July’s lineup TBATICKETS",
      "event_date": "2025-08-09",
      "start_time": "19:30",
      "end_time": null,
      "price": "N/A",
      "image": null,
      "url": null,
      "extraction_timestamp": "2025-07-02T20:14:15.203682"
    },
    {
      "venue_name": "Friends and Lovers",
      "title": "Not Your Average Open Mic (Copy)",
      "description": "Welcome to the third edition ofNot Your Average Open Micat Friends and Lovers—a night dedicated to raw talent, authentic connection, and unforgettable vibes. This month we're spotlighting Afrobeats, with a live performances alongside our host,David Foreign, showcasing a lineup of dynamic artists who embody the bold energy and expressive soul of the genre. Whether you're stepping on stage or soaking it all in from the crowd, this experience is all about amplifying creative voices and building community.RSVP",
      "event_date": "2025-08-13",
      "start_time": "19:30",
      "end_time": null,
      "price": "N/A",
      "image": null,
      "url": null,
      "extraction_timestamp": "2025-07-02T20:14:15.203964"
    },
    {
      "venue_name": "Friends and Lovers",
      "title": "Open To Work: An Unemployed Comedy Show",
      "description": "A hilarious comedy show about surviving Linked-In, layoffs, and late-stage capitalism. Featuring a line-up of comedians who have been there. Come get the corporate catharsis you need. Hosted byAmanda Melhuish(Reductress) andCat Montesi(Wolfpack).Saturday’s Lineup TBASheria MattisTina SiebenLili PujolRiylan MillsBridget FoleyTICKETS",
      "event_date": "2025-06-28",
      "start_time": "19:30",
      "end_time": null,
      "price": "N/A",
      "image": null,
      "url": null,
      "extraction_timestamp": "2025-07-02T20:14:15.204267"
    },
    {
      "venue_name": "Friends and Lovers",
      "title": "SAZONAO",
      "description": "Whether it’s Reggaeton, Afrobeat, Dembow, Pop, Dancehall, or Cumbia SAZONAO always got something spicy cooking up with resident DJ Woof at point. It’s time to run up all of the rhythms of the diaspora Friday, June 27th, at FnL with special guests from 10pm till 4AM.$10 general admission*$5 w/ RSVP before 11PM** =No RequestsRSVP",
      "event_date": "2025-06-27",
      "start_time": null,
      "end_time": null,
      "price": "N/A",
      "image": null,
      "url": null,
      "extraction_timestamp": "2025-07-02T20:14:15.204552"
    },
    {
      "venue_name": "Friends and Lovers",
      "title": "Annie Hildebrand and Friends (Live Comedy)",
      "description": "Watch local standout comedians do their best set at the pleasure of oneAnnie Hildebrand, comedy czar of the evening. After each set, she'll give a thumbs up or thumbs down, gladiator style, to determine if that comedian is allowed to continue their comedy career, or if they must quit forever. In the middle of the show, these stakes are then passed over to the audience where those who choose to participate are thrown into the pop culture gauntlet, competing in a round of trivia. Winners get prizes and losers must quit trivia for the rest of their lives.June’s lineup includesBrittany CarneyAnna BiancoPatrick HastieDan TreadwayArielle DundasHosted By:Annie HildebrandTICKETS",
      "event_date": "2025-06-27",
      "start_time": "19:30",
      "end_time": null,
      "price": "N/A",
      "image": null,
      "url": null,
      "extraction_timestamp": "2025-07-02T20:14:15.204695"
    },
    {
      "venue_name": "Friends and Lovers",
      "title": "The Wednesday Get Down: DJ Practice + Friends",
      "description": "Get up and get down Wednesday, May 14th with DJ Practice and the homies at Friends and Lovers. Expect House, Disco, Funk, Afrobeat & more from 8pm until late!",
      "event_date": "2025-06-25",
      "start_time": null,
      "end_time": null,
      "price": "N/A",
      "image": null,
      "url": null,
      "extraction_timestamp": "2025-07-02T20:14:15.204975"
    },
    {
      "venue_name": "Friends and Lovers",
      "title": "Cookout On Classon: A Juneteenth Weekend Celebration",
      "description": "Friday, June 20th, pull up and shake a leg at Friends and Lovers forCookout on Classon, our Juneteenth weekend celebration featuringDelaceiba, Just Dame, and friends all night long. Nothing but heat on deck from 10pm to 4am as we warm up for a beautiful Brooklyn summer full of cookout classics from Funk and Soul to Hip-Hop, R&B, and much much more!$5 w/ proof of RSVP before 11pm*$10 general admission**= No RequestsRSVP",
      "event_date": "2025-06-20",
      "start_time": "22:00",
      "end_time": null,
      "price": "N/A",
      "image": null,
      "url": null,
      "extraction_timestamp": "2025-07-02T20:14:15.205130"
    },
    {
      "venue_name": "Friends and Lovers",
      "title": "Awkward Sex...And The City",
      "description": "Awkward Sex is exactly what it sounds like: comedians reliving intimate tales about their sex life and breaking barriers about sex and dating.Hosted by Natalie Wall, the show pairs sexual inclusion with humor and sheds light on the awkward universal experience we all know and love.Awkward Sex is about taking taboo subjects and creating a safe space for people to feel seen and heard.From cocaine infused one night stands to IBS flare ups during cunnilingus, you and your friends will be hanging on to every word and excited to go out and have a sexual misadventure of your own.“Good sex is always good sex, but it takes a special person to turn bad sex into something amazing. And that’s where our New York comedian and podcaster Natalie Wall comes in.” -Philadelphia Gay News“The voyeur within will delight.” – Refinery29TICKETS",
      "event_date": "2025-06-20",
      "start_time": "19:30",
      "end_time": null,
      "price": "N/A",
      "image": null,
      "url": null,
      "extraction_timestamp": "2025-07-02T20:14:15.205550"
    },
    {
      "venue_name": "Friends and Lovers",
      "title": "Love Language: A Singles Dance Party for Women Who Love Women",
      "description": "Love Language: A Singles Dance Party for Women Who Love WomenJune 18th | 8PM–11PM📍 Friends and Lovers — 641 Classon Ave, Brooklyn🎧 With DJsPero Whatever$5 | RSVP Required✨Proceeds benefit the Immigrant Defense Project (IDP)Looking to meet someone who speaks your love language? Join us atLove Language— a dance party for ladies who love ladies, made especially for singles who want to vibe, flirt, and maybe find their next crush (or summer fling 👀).We'll have the music to move you, the room to make moves, and the community to hold you. Whether you're dancing solo or syncing steps with someone new, this night is for you.Spots are limited, so grab your ticket and RSVP now. Let’s make some sparks — and support immigrant rights while we’re at it. ❤️‍🔥RSVP",
      "event_date": "2025-06-18",
      "start_time": "20:00",
      "end_time": null,
      "price": "N/A",
      "image": null,
      "url": null,
      "extraction_timestamp": "2025-07-02T20:14:15.206167"
    },
    {
      "venue_name": "Friends and Lovers",
      "title": "Family Biz: Groove Hard, Nap Later",
      "description": "Think of it as the ultimate dance party for people who love music and have kids. You don’t have to trade your groove for nap schedules—just bring the kids along.Groove hard, nap later.See you there!Hosted on yourfavoriteBrooklyn dance floor (the one where you’ve spent late nights with epic beats), this time it's all about the kidsandthe grown-ups who love them.Expect booty shaking favorites fromAli ColemanandMiss Alicia.We’ve got:Light snacksfor the little snackers (don’t worry, parents, we’ve got drinks for you too).A vibe that’ll have you saying: “Who needs a sitter when we’ve got this?”Friends and Lovers641 Classon Ave, Crown Heights BKRSVP",
      "event_date": "2025-06-07",
      "start_time": "15:00",
      "end_time": null,
      "price": "N/A",
      "image": null,
      "url": null,
      "extraction_timestamp": "2025-07-02T20:14:15.206540"
    },
    {
      "venue_name": "Friends and Lovers",
      "title": "Silly Time (Live Comedy)",
      "description": "SILLY TIME IS BACK!!! Friends of all improv “levels” are collaborating for one special night. CAN’T WAIT TO C U THERE!!Friday’s lineup includesAudrey FromsonErik MartiniAnne LimGracie HirschLindsey HinesAndy WardRima ParikhMr. CardboardTickets",
      "event_date": "2025-06-06",
      "start_time": "19:30",
      "end_time": null,
      "price": "N/A",
      "image": null,
      "url": null,
      "extraction_timestamp": "2025-07-02T20:14:15.206861"
    },
    {
      "venue_name": "Friends and Lovers",
      "title": "NQOMA",
      "description": "NQOMA is a party series by Umumaroon that celebrates the African & diasporic drum cultures moving dance music worldwide. From amapiano to batida, baile funk to GQOM, afrobeats to jersey club and more, NQOMA is guaranteed to shake the dancefloor and move bodies featuring some the city's finest selectas.",
      "event_date": "2025-06-05",
      "start_time": null,
      "end_time": null,
      "price": "N/A",
      "image": null,
      "url": null,
      "extraction_timestamp": "2025-07-02T20:14:15.207146"
    },
    {
      "venue_name": "Friends and Lovers",
      "title": "Ricardo Grilli Trio",
      "description": "Experience an unforgettable evening at Friends and Lovers in Brooklyn as the Ricardo Grilli Trio brings their electrifying fusion of modern jazz, rock, funk, and Brazilian rhythms to the stage. Led by guitarist Ricardo Grilli, a rising star in the jazz scene who has graced iconic venues such as Smalls Jazz Club, The Blue Note, and the 55 Bar, the trio delivers a dynamic performance that blends virtuosic improvisation with infectious grooves. Drawing inspiration from luminaries like John Scofield and Eric Krasno, Grilli's compositions and arrangements showcase his unique voice as a composer and guitarist. With a rich musical background that includes performances with artists like Chris Potter, Aaron Parks, and Joe Martin, this is a night of music you won't want to miss.TICKETS",
      "event_date": "2025-05-30",
      "start_time": "19:30",
      "end_time": null,
      "price": "N/A",
      "image": null,
      "url": null,
      "extraction_timestamp": "2025-07-02T20:14:15.207277"
    },
    {
      "venue_name": "Friends and Lovers",
      "title": "TAROT, TRUTH AND THE TURNING SEASON",
      "description": "Join us for an evening of tarot readings, uncovering truths, and embracing the changing seasons together!Tickets",
      "event_date": "2025-05-28",
      "start_time": "19:00",
      "end_time": null,
      "price": "N/A",
      "image": null,
      "url": null,
      "extraction_timestamp": "2025-07-02T20:14:15.207542"
    },
    {
      "venue_name": "Friends and Lovers",
      "title": "FNL All-Star Weekend (Sat.): feat. Getlive!, Boogie Blind, Taj, & Fried Dynamite",
      "description": "Saturday night we carry on tradition for Memorial day weekend and get on the good foot with classics you know and love across Soul, Hip-Hop, Funk, Dancehall, and more.So pull up and keep those hips in motion all night long with hostSpecks \"Funky\" Johnsonalongside djsTaj,Boogie Blind,Getlive!,Fried Dynamite, andspecial guestsfrom 10pm until late!!$10 General  Admission*Discounted Entry w/ RSVP before 11pm*= No RequestsRSVP",
      "event_date": "2025-05-24",
      "start_time": null,
      "end_time": null,
      "price": "N/A",
      "image": null,
      "url": null,
      "extraction_timestamp": "2025-07-02T20:14:15.207808"
    },
    {
      "venue_name": "Friends and Lovers",
      "title": "FNL All-Star Weekend (Fri.): feat. Mitchfactorial, Dash Speaks, & JustDame",
      "description": "Extended weekend is approaching and we’re kicking things off on Friday with an extra special night full of fun, music, and mayhem alongside djsJustDame(Happy Birthday!),Mitchfactorial,Dash Speaks, andspecial guests!!So come through and celebrate the warm weather as we turn things up a notch with classics you know and love across Soul, Hip-Hop, Funk, Dancehall, and more!$10 General  Admission*$5 Early Bird Admission* (all night)Discounted Entry w/ RSVP before 11pm*= No RequestsRSVP",
      "event_date": "2025-05-23",
      "start_time": null,
      "end_time": null,
      "price": "N/A",
      "image": null,
      "url": null,
      "extraction_timestamp": "2025-07-02T20:14:15.207942"
    },
    {
      "venue_name": "Friends and Lovers",
      "title": "B.Y.O.V. (Bring Your Own Vinyl) Happy Hour",
      "description": "It’s Thursday, so let’s groove as we stay ahead and start the weekend early with our 8 dollar classic cocktails from open to close.Bring Your Own Vinyl during happy hour for us to play (one at a time please), and we’ll have a time with good friends, great cocktails, and even better music.",
      "event_date": "2025-05-22",
      "start_time": "19:00",
      "end_time": null,
      "price": "N/A",
      "image": null,
      "url": null,
      "extraction_timestamp": "2025-07-02T20:14:15.208088"
    },
    {
      "venue_name": "Friends and Lovers",
      "title": "Ben Pagano + Nico Fox + Fury Young (Live)",
      "description": "Join us at Friends and Lovers for an eclectic evening of soulful and ethereal music featuring local NYC songwritersBen Pagano,Nico Fox, andFury Young.Ben Pagano is a local singer-songwriter, pianist and actor. His music is a blend of jazz, pop, soul, funk and psychedelia whilst maintaining a cohesiveness that defines the sound. His work is critically acclaimed and has been covered in publications such as New Yorker Magazine, Deli Magazine, Impose, Tiny Mixtapes to name some. He is currently working on his fourth album which will be released later this year.listen -benpagano.bandcamp.comBrooklyn-based artist Nico Fox, known professionally as Real Clothes, blends melancholy Appalachian folk with industrial rhythms, creating a sound fans describe as \"haunted Sade\" and\"apocalypse pop.\" With four albums and numerous singles, including her latest, Undone by You, her music delves into themes of betrayal, revenge, and obsession.Beyond music, Fox is also a writer and the author of The Art of Transmutation, a poetry collection available in English and Haitian Kreyòl.Listen-https://realclothes.bandcamp.com/Fury Young is an artland rocker and surrealist rapper who grew up in downtown NYC in the 1990s. For years he has worked in music championing voices of other artists with FREER Records (formerly Die Jim Crow) - the first label in America for musicians in prison and formerly incarcerated. All the while, Fury was working on songs of his own that he never had time to finish or release. That changed in October 2023 with the debut of \"X Ray,\" Fury's first song on streaming. Fury will be releasing a full length album this summer.Listen -https://open.spotify.com/intl-es/artist/4VXTDaM4TCu8VRy8B6eCEOTickets",
      "event_date": "2025-05-17",
      "start_time": "19:00",
      "end_time": null,
      "price": "N/A",
      "image": null,
      "url": null,
      "extraction_timestamp": "2025-07-02T20:14:15.208472"
    },
    {
      "venue_name": "Friends and Lovers",
      "title": "Friday Night Flava: DJ Phantom x Delaceiba x DJ Kay Kay 47",
      "description": "Friday Night is overflowing with Flava May 16th withDelaceibaandDJ Phantom, alongside special guestDJ Kay Kay 47and moreall night long from 10PM until late as we rock through the latest and greatest danceworthy classics whether it’s Hip-Hop, R&B, Soul Dancehall, or R&B!So pull up on us with a friend or a lover in Crown Heights to experience a night in BK on a dancefloor you can trust.This is most definitely something you do not want to miss!$10 general admission*$5 early bird available (limited supply)$5 w/ RSVP before 11PM*=No RequestsALL SALES FINALRSVP",
      "event_date": "2025-05-16",
      "start_time": null,
      "end_time": null,
      "price": "N/A",
      "image": null,
      "url": null,
      "extraction_timestamp": "2025-07-02T20:14:15.208957"
    },
    {
      "venue_name": "Friends and Lovers",
      "title": "Where You At?: A Night Dedicated to World Dance Music",
      "description": "LSJandSOUNDSBYGOreturn with another edition of @whereyouatradio this Thursday, May 15th!Pull up and move to the sounds ofglobal dance music— fromAmapianoandAfrobeatstoBaile Funkand beyond. The energy will be high, the rhythms nonstop.🎶 Free with RSVP⏰ Party starts at 10PMCome ready to dance!RSVP",
      "event_date": "2025-05-15",
      "start_time": null,
      "end_time": null,
      "price": "N/A",
      "image": null,
      "url": null,
      "extraction_timestamp": "2025-07-02T20:14:15.209173"
    },
    {
      "venue_name": "Friends and Lovers",
      "title": "Craft and Sip at...Friends and Lovers",
      "description": "Do you love crafts? Really tasty drinks? Good company? On May 14th at 7pm, Friends and Lovers and Alijah Webb (@cutestcraftclub) will be hosting a craft event! We’ll be decorating ceramic trinket dishes with porcelain-specific paint markers. This is a fun way to create something that you’ve made yourself.All materials for the craft are included, drinks are separate. All you’ll need to do afterward is pop the dish in the oven to cure the paint.2 drink suggested minimum 🫶TICKETS",
      "event_date": "2025-05-14",
      "start_time": "19:00",
      "end_time": null,
      "price": "N/A",
      "image": null,
      "url": null,
      "extraction_timestamp": "2025-07-02T20:14:15.209445"
    },
    {
      "venue_name": "Friends and Lovers",
      "title": "Quickies: Singles Event",
      "description": "Welcome to the hottest NYC-based singles event! Hotties everywhere are calling this event \"better than hinge\".Quickies is a loosely structured speed dating/singles mixer aimed to help the lonely, sexy, slutty folks of NYC find someone for the rest of their lives (or at least one night).Quickies is queer friendly. Feel free to write your preferences on your name-tag so others can know what to expect when chatting with you.We are partnering with Friends and Lovers's JAZZ NIGHT to create an intimate evening that can continue past the length of the speed dating event. Live Jazz will be played in the front bar until late. This is the perfect opportunity to get to know your strongest connection a little bit more.DETAILS:Wednesday, April 2nd at 7PM. Doors open at 7. Speed dating starts at 7:30 PM promptly.21+ (It's at a bar...)PLEASE SIGN UP WITH YOUR LEGAL NAME AND HAVE AN ID TO SHOW AT THE DOOR.Mid-20s to Late 30sCapacity will be limited to 75 participants so make sure you and your hot friends RSVP.FYI:Please be respectful, communicative, and consensual. All a*sh*les will be removed for the safety and wellbeing of the participants.Refunds will not be issued on the day of the event.DISCLAIMER: By attending this event, you agree to being photographed for marketing materials. If you object, please let me know and we will try our best to not to post any photos or videos taken of you.TICKETS",
      "event_date": "2025-05-07",
      "start_time": "19:00",
      "end_time": null,
      "price": "N/A",
      "image": null,
      "url": null,
      "extraction_timestamp": "2025-07-02T20:14:15.209868"
    },
    {
      "venue_name": "Friends and Lovers",
      "title": "Boogie Blind Presents: Easily",
      "description": "Light things up Friday night , June 6th, on BK’s most trusted dance floor with top tier party starter and Uptown legend,DJ Boogie Blind, alongside special guestsfor “Easily”, a club night connecting nostalgic and new eras of the sounds that shaped the Big Apple whether it's Hip-Hop, Dancehall, Soul, or R&B.Pull up to Friends and Lovers and cut up for a night to remember at “Easily” with special guests alongside resident Boogie Blind from 10PM to 4AM every second Friday of the month.$10 general admission*$5 before 11PM w/ proof of RSVP*= No RequestsAll Sales FinalRSVPDJ Boogie Blind, is one of the most trusted and respected DJs in the industry today. As a Harlem representative, World Champion, and member of the pioneering X-Ecutioners DJ crew Boogie Blind has consistently served up NY’s true sound internationally for over two decades. Whether he’s rocking crowds for Coachella, NBA All Star Weekend, Montreux Jazz Fest, or the Espy Awards, Blind is always pushing the envelope in the booth with timeless Hip-hop, Funk, Dancehall, Disco, and House of yesterday and today.",
      "event_date": "2025-05-05",
      "start_time": null,
      "end_time": null,
      "price": "N/A",
      "image": null,
      "url": null,
      "extraction_timestamp": "2025-07-02T20:14:15.210261"
    },
    {
      "venue_name": "Friends and Lovers",
      "title": "Friday Night LIVE: Hip-Hop, Dancehall, R&B, and More",
      "description": "Friday Night is all the way LIVE with Getliive! and Baydriana at FnL May 2nd from 10PM until late as we shake the room with classics cuts from Hip-Hop and R&B to Dancehall, Soul and more!So pull up on us with a friend or a lover in Crown Heights, BK to experience a night on a dancefloor you can trust.This is most definitely something you do not want to miss!$10 general admission*$5 early bird tickets (limited supply)*$5 w/ RSVP before 11PM**=No RequestsALL SALES FINALRSVP",
      "event_date": "2025-05-02",
      "start_time": null,
      "end_time": null,
      "price": "N/A",
      "image": null,
      "url": null,
      "extraction_timestamp": "2025-07-02T20:14:15.210406"
    },
    {
      "venue_name": "Friends and Lovers",
      "title": "Casa Mantequilla (Live)",
      "description": "Get ready to dance with Casa Mantequilla, a high-energy and cross-cultural New York band featuring musicians from America, Puerto Rico, Nigeria, Belgium, and Congo. We mix West African, Latin, and American beats, singing in multiple languages for an unforgettable concert experience. Don’t miss the rhythm, the energy, and the vibe!ALL SALES FINALTICKETS",
      "event_date": "2025-04-25",
      "start_time": "19:30",
      "end_time": null,
      "price": "N/A",
      "image": null,
      "url": null,
      "extraction_timestamp": "2025-07-02T20:14:15.210599"
    },
    {
      "venue_name": "Friends and Lovers",
      "title": "DJ Malachi (Happy Hour)",
      "description": "Friday April 18th join us at FnL for $8 classic cocktails with DJ Malachi Jean playing danceworthy classics for happy hour",
      "event_date": "2025-04-18",
      "start_time": "19:00",
      "end_time": null,
      "price": "N/A",
      "image": null,
      "url": null,
      "extraction_timestamp": "2025-07-02T20:14:15.210943"
    },
    {
      "venue_name": "Friends and Lovers",
      "title": "Back Outdoors: Hundred in the Hand and Deer Lady",
      "description": "Join us Thursday April 10th for a live performance by Hundred in The Hand as they return to Brooklyn with support from Deer Lady.Hundred in The Hand is a band Based in the Dakotas fronted by vocalist, artist and activist Tokata Iron Eyes. A musical exercise in radical healing, and curious rage, serving as a sonic bridge between the stagnancy of traumas and the tenets of hope for a revolutionary future. The band is ever evolving and growing, co-creating with interchanging and intersecting artists across disciplines and the world.TICKETS",
      "event_date": "2025-04-10",
      "start_time": "19:30",
      "end_time": null,
      "price": "N/A",
      "image": null,
      "url": null,
      "extraction_timestamp": "2025-07-02T20:14:15.211213"
    },
    {
      "venue_name": "Friends and Lovers",
      "title": "Nightlife United Community Happy Hour + Dance Party: Hosted by Venus Cuffs",
      "description": "Nightlife United is celebrating 5 years of industry impact withVenus Cuffs! A trailblazer in nightlife and cultural organizing, Venus Cuffs has created space and visibility for QTBIPOC communities, carving out room for joy, resistance, and radical celebration. Join us this Friday for a very specialCommunity Happy Hour fundraiser—a night of connection, music, and purpose.Nightlife United is an industry resource and advocacy non-profit coalition established by and for the Nightlife community. The organization is raising funds for theNU Workforce Development programthat upskills future Nightlife leaders from under-recognized communities.You’ll be in the room with some of NYC’s most respected nightlife veterans—an amazing opportunity to network, ask questions, and soak up wisdom from the folks who’ve built and sustained this city's cultural backbone.Expect:Incredible musicA room full of colleagues, creatives, supporters—and YOUThe chance to support the future of nightlife while celebrating its legacyDJ set by a special guest DJ (if you FnL then you know it'll be good!)Come early, stay late, and celebrate five years of impact with us.RSVP",
      "event_date": "2025-04-04",
      "start_time": "19:00",
      "end_time": null,
      "price": "N/A",
      "image": null,
      "url": null,
      "extraction_timestamp": "2025-07-02T20:14:15.211478"
    },
    {
      "venue_name": "Friends and Lovers",
      "title": "Bored of Dating Apps (Singles Only Dance Party)",
      "description": "It’s been two years of so much love, friendship, laughs, snogs, countless numbers exchanges, keys exchanged, friends' holidays planned and incredible connections have been formed. Whether it’s a romantic relationship or a pal for life, we’re so happy with what’s been happening atBODA.Our socials have been described as wholesome, great for single peoples' mental health and events which are so good they make you wanna stay single, so come for great vibes & lovely people.We're hosting this social at theultimate singles' party,Friends and Lovers,where guests can connect at the bar over cocktails or over on the dancefloor...About the venue:Friends and Lovers is a project of passion, friendship, and love. Our mission is to provide a safe space for all kinds of people to let loose, be themselves, dance, make friends, fall in love, and party their hearts out, and a stage for creatives of all types to push envelopes and pull heart strings.What to expect:- A room where everyone is single. That's one of the only rules we have - you must be single to enter in. This is our singles club. A space free of couples, families, kids etc, a place just for us to let our hair down and be with like-minded people.- A 'Dutch Courage' shot (totally optional, so don't worry if this isn't your thing) along with a BODA mindful icebreaker- Our community-feel events attract a room full of brilliant people who appreciate slower, healthier, kinder approach to dating over the fast & furious modern dating climate singles are up againstEssential need-to-know bits:- EVERYONE IS WELCOME, whatever your sexuality or gender - as long as you're over 21-We cannot control the level of ratios on the night (men to women, women to women, men to men etc), so please do bear this in mind when booking a ticket.We do however try very hard to get a great, wide mix of ages, genders and sexualities, as we want everyone to have a fantastic night- Feel free to ask us any questions through this or follow us on Instagram to get a feel for our socials :@boredofdatingapps*Because of the nature of this event, there are no refunds or transfers. Ticket holders can only sell ticket on if the person shares the same gender on the ticket*- By purchasing a ticket means you consent to BODA taking videos and pictures of the event to post on our social media pages.Our hosts can't wait to meet you! See you there for good times.TICKETS",
      "event_date": "2025-04-03",
      "start_time": "19:00",
      "end_time": null,
      "price": "N/A",
      "image": null,
      "url": null,
      "extraction_timestamp": "2025-07-02T20:14:15.211791"
    },
    {
      "venue_name": "Friends and Lovers",
      "title": "A Really Good Comedy Show",
      "description": "Stiff drinks, solid people, and A Really Good Comedy Show this Friday March 28th hosted by none other thanLilly Sparksfresh off a sold out February show!Lineup includesAmber SingletaryDarius DinkinsRufat AgayevHosted by:Lilly SparksTickets",
      "event_date": "2025-03-28",
      "start_time": "19:30",
      "end_time": null,
      "price": "N/A",
      "image": null,
      "url": null,
      "extraction_timestamp": "2025-07-02T20:14:15.212153"
    },
    {
      "venue_name": "Friends and Lovers",
      "title": "Soothsayer: A Comedy Open Mic",
      "description": "Unsure of the future, your love life, or your Wednesday evening plans? Fear not, for the oracle will answer all. Let the muses speak through you in a three minute set at this prophetic comedy open mic hosted by known seers Emily Villarreal and Adison Eyring. Come, weary traveler, to see the future (of comedy)!Sign Up: 7:00PM* (first come first serve in person)Start Time: 7:30PM**= Proof of Drink purchased required for participationRSVP",
      "event_date": "2025-03-26",
      "start_time": "19:00",
      "end_time": null,
      "price": "N/A",
      "image": null,
      "url": null,
      "extraction_timestamp": "2025-07-02T20:14:15.212490"
    },
    {
      "venue_name": "Friends and Lovers",
      "title": "FnL Presents: Baydriana x Iamnotmyhistory x A2Z",
      "description": "Show up and show out Sat. March 22nd with a²z, Baydriana, and Iamnotmyhistory  all night long from 10PM to 4AM as we rock through the latest and greatest danceworthy classics whether it’s Hip-Hop, R&B, Soul Dancehall, or R&B!So pull up on us with a friend or a lover in Crown Heights to experience a night in BK on a dancefloor you can trust.This is most definitely something you do not want to miss!$10 general admission*$5 early bird available (limited supply)$5 w/ RSVP before 11PM*=No RequestsALL SALES FINALRSVP",
      "event_date": "2025-03-22",
      "start_time": null,
      "end_time": null,
      "price": "N/A",
      "image": null,
      "url": null,
      "extraction_timestamp": "2025-07-02T20:14:15.212858"
    }
  ],
  "events_count": 50
}