{
  "venue_name": "Barbes",
  "extraction_timestamp": "20250616_164100",
  "data": [
    {
      "image": "https://viewcy-heroku-production.s3.amazonaws.com/courses/featured_images/000/017/429/cover/Angelika_and_Marta.jpg?1746984321",
      "eventDate": "Mon,  Jun 16 2025",
      "startTime": "Mon,  Jun 16 2025",
      "endTime": "Mon,  Jun 16 2025",
      "title": "ANGELIKA NIESCER with  MARTA SANCHEZ",
      "description": "Angelika Niescer with Marta Sanchez      Angelika and Marta are two adventurous improvisers living far apart. After meeting in New York and discovering a strong musical connection during an improvised session, they decided to explore their collaboration as a duo. They gave their first concert together in Berlin a couple of years ago, and have come a long way since. Join them in Brooklyn for a night of creative improvisation and the unique blend of their musical voices—live in concert.       $20 suggested Donate here in advance or in person during the performance"
    },
    {
      "image": "https://viewcy-heroku-production.s3.amazonaws.com/courses/featured_images/000/017/674/cover/TALLER-toca_plena.jpg?1748358504",
      "eventDate": "Mon,  Jun 16 2025",
      "startTime": "Mon,  Jun 16 2025",
      "endTime": "Mon,  Jun 16 2025",
      "title": "TROPICAL VORTEX Presents: TALLER TOCA PLENA",
      "description": "TROPICAL VORTEX    is Barbès long-running series showcasing all manners of tropical styles from Latinolandia with live band and DJs playing cumbia, chicha, guaguanco, mambo, plena, Sanjuanitos and other styles of vintage or not so vintage styles.     Past artists include Combo Chimbita, Chicha Libre, Los Cumpleaños, Bulla en el Barrio with appearances by Chico Trujillo, Frente Cumbiero, Los Gaiteros de San Jacinto, Son Palenque, Son Rompe Pera, Paito y los Gaiteros de Punta Brava, Ceferina Banquez, Meridian Brothers, La Perla and many many more..       TALLER TOCA PLENA  &nbsp;A community oriented Puerto Rican Plena project focused on identity, conservation, collective participation - and fun!     Featuring resident&nbsp; DJs Adrian is Hungry and&nbsp; Sonido Chichadelico&nbsp; And special guests tba&nbsp;       $15 suggested - Click Donate to pay in advance     Produced with our friends at Ilegal Mezcal"
    },
    {
      "image": "https://viewcy-heroku-production.s3.amazonaws.com/courses/featured_images/000/017/026/cover/Tamar_Korn.jpg?1744755818",
      "eventDate": "Tue,  Jun 17 2025",
      "startTime": "Tue,  Jun 17 2025",
      "endTime": "Tue,  Jun 17 2025",
      "title": "TAMAR KORN & A KORNUCOPIA",
      "description": "Tamar Korn , she of  Brain Cloud  and  Cangelosi Cards  fame, has been dazzling us for over a decade, surprising us at every turn with her choice of repertoire, hopscotching, in one set, from early jazz, Western swing and American roots music to Yiddish songs, vocal solos and unexpected recitatives involving new and old poetry and philosophical essays.  Tamar doesn't use a template, she creates it as she goes along.&nbsp;   Friends, not always timely named, always come and join. &nbsp;       $20 suggested Pay now online or that day in person,"
    },
    {
      "image": "https://viewcy-heroku-production.s3.amazonaws.com/courses/featured_images/000/016/726/cover/Slavic_Soul_Party_live_at_barbes.jpg?1743125652",
      "eventDate": "Tue,  Jun 17 2025",
      "startTime": "Tue,  Jun 17 2025",
      "endTime": "Tue,  Jun 17 2025",
      "title": "SLAVIC SOUL PARTY",
      "description": "SLAVIC SOUL PARTY - Every Tuesday. (for ever..)         Fiery Balkan brass, throbbing funk grooves, Roma accordion wizardry, and virtuoso jazz chops: Slavic Soul Party! is just what it says. Brash and strong as slivovitz, these nine musicians have forged a virtuosic new brass band music in the heart of New York City; they have held their Tuesday bacchanal for now 18 years and - and it has become a destination for locals and brass band fans from around the globe.    John Carlson  &amp;  Kenny Warren  (trumpet),  Peter Hess  (sax/clarinet),  Peter Stan  (accordion),  Tim Vaughn  &amp;  Adam Dotson  (trombone),  Ken Bentley  (tuba),  Matt Moran  and  Chris Stromquist  (go/snare/perc).   9pm to midnight."
    },
    {
      "image": "https://viewcy-heroku-production.s3.amazonaws.com/courses/featured_images/000/016/856/cover/MOONDOG_On_The_Keys_1920x1080.jpg?1743974873",
      "eventDate": "Wed,  Jun 18 2025",
      "startTime": "Wed,  Jun 18 2025",
      "endTime": "Wed,  Jun 18 2025",
      "title": "MOONDOG: ON THE KEYS",
      "description": "JULIAN CALV | SARAH PENNA | ALEX STEWART      A concert featuring piano works, vocal canons, and other songs by the maverick composer Moondog performed by trimbist/vocalist  Julian Calv , pianist  Alex Stewart , and vocalist/percussionist  Sarah Penna .  Louis Hardin AKA  Moondog  composed music creating an unexpected link between the resurgent science of counterpoint, Arapaho, Navajo, Blackfoot, and Sioux rhythms and song forms, the art of jazz improvisation, and the beginnings of a repetitive and minimalist aesthetic.  The concert spans Moondog’s career with selections from  The Last Concert, Moondog: Piano Trimba, In Europe, A New Sound Of An Old Instrument, Moondog (1956) ; and includes comments about the music from Julian- who studied with Moondog’s only student,  Stefan Lakatos .   $20 suggested. Donate online now or in person that night."
    },
    {
      "image": "https://viewcy-heroku-production.s3.amazonaws.com/courses/featured_images/000/018/214/cover/Orchestre_Moto.jpg?1750088222",
      "eventDate": "Wed,  Jun 18 2025",
      "startTime": "Wed,  Jun 18 2025",
      "endTime": "Wed,  Jun 18 2025",
      "title": "ORCHESTRE MOTO",
      "description": "ORCHESTRE MOTO - Congolese Rumba.       Led by guitarist Solo De Kanto, originally from Bandundu Province in the Democratic Republic of Congo;  Orchestre Moto  is a band based in New York City that celebrates Congolese music - with a strong emphasis on the classic 70's sound of the likes of Franco's TPOK Jazz and Tabu Ley Rochereau.      Orchestre Moto  was co-founded by rhythm guitarist Julian Apter soon after he started taking lessons with Solo De Kanto. They met while playing together in Nkumu Katalay's Lifelong Project Band, where Julian played as the rhythm guitarist for five years. The group has played at the Sultan Room in Brooklyn and the Shrine is currently recording their first album.&nbsp;       $20 suggested      Donate now or in person that night.&nbsp;"
    },
    {
      "image": "https://viewcy-heroku-production.s3.amazonaws.com/courses/featured_images/000/017/087/cover/Daria_Grace_Ponies.jpg?1745240334",
      "eventDate": "Thu,  Jun 19 2025",
      "startTime": "Thu,  Jun 19 2025",
      "endTime": "Thu,  Jun 19 2025",
      "title": "THE PRE-WAR PONIES",
      "description": "THE PRE-WAR PONIES.   20s, 30s and 40s forgotten gems by the likes of Irving Berlin and Hoagy Carmichael but also Fred Ahlert, Joe Young, Chas Tobias, and Eddie Jones, none of whom are exactly household names. But maybe they should be...   With  Daria Grace  - vocals &amp; baritone ukulele,  J. Walter Hawkes  - trombone, ukulele &amp; vocals,  Jim Whitney  - bass, and  Willie Martinez  - drums.&nbsp;       $20 suggested     Pay now or that night in person"
    },
    {
      "image": "https://viewcy-heroku-production.s3.amazonaws.com/courses/featured_images/000/016/963/cover/Screen_Shot_2022-06-28_at_12.08.45.jpg?1744322650",
      "eventDate": "Fri,  Jun 20 2025",
      "startTime": "Fri,  Jun 20 2025",
      "endTime": "Fri,  Jun 20 2025",
      "title": "Oscar Noriega's CROOKED QUARTET",
      "description": "For years, composer and multi-instrumentalist   OSCAR NORIEGA   brought his Crooked Trio to Barbès every Friday from 5 to 7 - which he had conceived as a vehicle for his drumming.  Oscar is back with his crooked ways, but concentrating on his main instruments, alto saxophone and clarinets. The sets will retain the casual vibe of the trio, with a mixture of standards and Oscar's compositions.&nbsp;  Among other things, Oscar Noriega is a member of  Tim Berne’s Snakeoil,Endangered Blood  (Chris Speed, Jim Black, Trevor Dunn),  Boss Tenor  and he co-leads the brass band  Banda De Los Muertos  with Jacob Garchik.&nbsp;  With:  Oscar Noriega  - saxophone and clarinet;  Marta Sanchez  - Piano;  Christopher Tordini  - Bass and  Jason Nazary  - Drums       $20 suggested Donate here in advance or in person during the performance"
    },
    {
      "image": "https://viewcy-heroku-production.s3.amazonaws.com/courses/featured_images/000/017/102/cover/Tokala_with_Frank.jpg?1745247723",
      "eventDate": "Fri,  Jun 20 2025",
      "startTime": "Fri,  Jun 20 2025",
      "endTime": "Fri,  Jun 20 2025",
      "title": "Shoko Nagai's TOKALA",
      "description": "Shoko Nagai's TOKALA   explores the sound of the ancient connection between Japan and middle east via silk road where cultural exchange happened and left an imprint which became integral part of Japanese culture. We can raise awareness of the ancient connection between Far East Asia and Islamic world the middle east.    Shoko Nagai  ( accordion/ piano/ electronics, voice)  Satoshi Takeishi  ( percussion)  Frank London  ( trumpet)       8pm    $20 suggested&nbsp; Pay now online or in person that day"
    },
    {
      "image": "https://viewcy-heroku-production.s3.amazonaws.com/courses/featured_images/000/017/193/cover/guachinangos_new.jpg?1745543956",
      "eventDate": "Fri,  Jun 20 2025",
      "startTime": "Fri,  Jun 20 2025",
      "endTime": "Fri,  Jun 20 2025",
      "title": "GUACHINANGOS",
      "description": "GUACHINANGOS.      Folk fusion from another dimension, Guachinangos fuses son jarocho, cumbia, champeta and other rhythms with an irresistible swing. A mix of traditional and electric instrumentation makes for particularly vibrant shows, which are part dance party and part community gatherings.   With  Juan Carlos Marin  - requinto jarocho, voice;&nbsp;  Gabriella Grimaldi  - violin, voice;  Alberto Fontes  - electric guitar, jarana;  Victor Babilonia  - drums;  Elvira Bustamante  - maracas, voice, dance;  Leo Catricala  - bass;  Inka Ortiz  - tambor alegre.     $20 suggested Pay now online or that day in person,"
    },
    {
      "image": "https://viewcy-heroku-production.s3.amazonaws.com/courses/featured_images/000/016/954/cover/PAKULA.jpg?1744322364",
      "eventDate": "Sat,  Jun 21 2025",
      "startTime": "Sat,  Jun 21 2025",
      "endTime": "Sat,  Jun 21 2025",
      "title": "PAKULA SURPRISE",
      "description": "Pakula Surprise  is a trio with  Eric Pakula  on alto sax,  Blake  Lindberg  on drums and  Nick Cudahy  on bass.&nbsp; They play Eric Pakula’s compositions, which are a mashup of swing and country music combined with 1960’s TV music. They also play the music of Lenny Tristano, Charlie Parker and Bud Powell. Pakula’s biggest influences include Lee Konitz, Sydney Bechet and Paul Desmond.  They will be set up in our front room, in casual and acoustic fashion.&nbsp;       $15 suggested      donate in advance or pay in person that day.&nbsp;"
    },
    {
      "image": "https://viewcy-heroku-production.s3.amazonaws.com/courses/featured_images/000/017/596/cover/Joel_Harrison_guitar.jpg?1747856454",
      "eventDate": "Sat,  Jun 21 2025",
      "startTime": "Sat,  Jun 21 2025",
      "endTime": "Sat,  Jun 21 2025",
      "title": "JOEL HARRISON - Saturdays in June",
      "description": "Joel Harrison Guitar Choir    Saturdays in June.   Featuring guitarist  Joel Harrison i n quartet, trio, and duo, celebrating the infinity of the guitar   This week:  Joel Harrison's Guitar Choir&nbsp;   With  Anthony Pirog, Tim Watson, Jamie Fox, Joel Harrison  (guitars)    $20 suggested -&nbsp; Donate online now or in person that day.&nbsp;"
    },
    {
      "image": "https://viewcy-heroku-production.s3.amazonaws.com/courses/featured_images/000/016/736/cover/DAMIAN_QUINONES2.jpg?1743171137",
      "eventDate": "Sat,  Jun 21 2025",
      "startTime": "Sat,  Jun 21 2025",
      "endTime": "Sat,  Jun 21 2025",
      "title": "DAMIAN QUINONES Y SU CONJUNTO",
      "description": "Damian Quiñones  is a Puerto Rican, Bronx born singer/songwriter/guitarist. His current project is a solo based performance (guitar and voice) of his most recent album  \"Sleight of hand in the material realm\" . The  set  is also sprinkled with a number of songs from his catalog and a few thoughtful and relevant covers to round out the set.      Armed with a small battery of guitar gadgets and a projector, this isn't your traditional solo show. Damian's singing, fingerpicking, percussive guitar, and improvisational techniques are enhanced and expanded by the tasteful use of this trusty pedalboard.&nbsp;     Damian's mostly  hand drawn animation  invites the audience deeper into the song and helps create a more experiential environment for an audience that soon will find themselves being active participants.     The music is as eclectic as a city street, Rock and Roll, Folk, Cumbia, Reggae, and Salsa Dura all mixed together in a stew that might just pull you out of your seat and onto the dance floor.    Featuring:   ¸ Damian Quiñones -  guitar/vocals   Eleanor Kaufman -  keyboards/vocals   Carlos Caldero -  drums   Eudy Fernandez  - trumpet/percussion   Zack DiMarco  - guitar/vocals&nbsp;   Gregory Richardson -  guitar/percussion/vocals   Dave Hassell -  bass      $20 suggested Click Donate to pay in advance"
    },
    {
      "image": "https://viewcy-heroku-production.s3.amazonaws.com/courses/featured_images/000/017/816/cover/Imal_gnawa.jpg?1748966364",
      "eventDate": "Sat,  Jun 21 2025",
      "startTime": "Sat,  Jun 21 2025",
      "endTime": "Sat,  Jun 21 2025",
      "title": "IMAL GNAWA",
      "description": "Imal Gnawa’s  music is rooted in traditional Morrocan Gnawa music but adds a strong futuristic element. They use traditional instruments - sintir and krakrebs - augmented by electronic elements.   They just released their debut E.P, Twilight Prophecy.&nbsp;       $20 suggested. Donate now online or that night in person.&nbsp;"
    },
    {
      "image": "https://viewcy-heroku-production.s3.amazonaws.com/courses/featured_images/000/017/178/cover/Choro_Jam.jpg?1745499710",
      "eventDate": "Sun,  Jun 22 2025",
      "startTime": "Sun,  Jun 22 2025",
      "endTime": "Sun,  Jun 22 2025",
      "title": "CLUBE DO CHORO with REGIONAL SAMAUMA",
      "description": "Fernanda Silveira   leads a weekly Choro jam in our front room with Regional Samauma and special guests. A casual affair with  virtuosos.     Fernanda Silveira  is a cavaquinho player specializing in the Brazilian practices of choro and traditional samba. She is a disciple of Luciana Rabello and has accompanied many artists including guitarists Maurício Carrilho, Yamandu Costa and Zé Barbeiro, clarinetist Nailor Proveta, mandolinists Pedro Amorim and Miltinho Mori, as well as Ronaldo do Bandolim and Jorginho do Pandeiro.&nbsp;      $15 suggested      donate in advance or pay in person.&nbsp;"
    },
    {
      "image": "https://viewcy-heroku-production.s3.amazonaws.com/courses/featured_images/000/017/104/cover/Pipiris_Nights.jpg?1745243658",
      "eventDate": "Sun,  Jun 22 2025",
      "startTime": "Sun,  Jun 22 2025",
      "endTime": "Sun,  Jun 22 2025",
      "title": "PIPIRIS NIGHTS - Joropos llaneros from Venezuela",
      "description": "PIPIRIS NIGHTS   Once a month - the 4th Sunday at 6pm - Venezuelan musician Mafer Bandola (of Ladama fame) gathers friends for a Joropo session. Joropos are the main rhythm in Venezuelan Llanera folklore and are at the heart of the rich musical culture of the plains of both Venezuela and Colombia.   Musica Llanera, as it is often called, is not well known outside of the country - it is played on cuatro, maracas, bass, harp and bandola - and draw from hybrid traditions including African, indigenous, criollo and Spanish traditions.  And what does Pipiris mean? you might ask..  The spanish expression   pípirisnais   is a deformation of the english phrase   “People is nice”  &nbsp; - now you know.&nbsp;  More details soon.&nbsp;       $20 suggested.&nbsp; Donate online now or in person that night.&nbsp;"
    },
    {
      "image": "https://viewcy-heroku-production.s3.amazonaws.com/courses/featured_images/000/017/772/cover/T_MARIE.jpg?1748799531",
      "eventDate": "Sun,  Jun 22 2025",
      "startTime": "Sun,  Jun 22 2025",
      "endTime": "Sun,  Jun 22 2025",
      "title": "T MARIE & BAYOU JUJU",
      "description": "Marie &amp; Bayou Juju  play traditional and original Louisiana music. In addition to honoring traditional  Cajun, Creole, Zydeco, Swamp Pop, Country, Blues , and  New Orleans  songs, the band also contributes to the next generation of South Louisiana sound with their own original tunes, performed in both Louisiana French and English.  The band started through gatherings at fires, suppers, porches, and levees,&nbsp; and you’ll feel this vibrant community of friendship echo through all of their music. These days you can catch&nbsp; them at dive bars, dancehalls, and festivals, sharing that same good juju and joy.  They play regularly in New Orleans, and the band has toured in California, Colorado, NorthCarolina, France, and Spain. Get on your dancing shoes and shrimp boots, and join in on .... Cajun below sea level!   $20 suggested"
    },
    {
      "image": "https://viewcy-heroku-production.s3.amazonaws.com/courses/featured_images/000/017/106/cover/REGGIE_CHAPHOUSE.jpg?1745243746",
      "eventDate": "Sun,  Jun 22 2025",
      "startTime": "Sun,  Jun 22 2025",
      "endTime": "Sun,  Jun 22 2025",
      "title": "REGINALD CHAPMAN'S CHAPHOUSE",
      "description": "Currently based in Brooklyn, NY (by way of Richmond, Virginia and Champaign, Illinois),  REGINALD CHAPMAN   thrives at a three-point intersection of preserving the classics, embracing the now, and breaking new ground towards the future. Certified with a Doctorate in Jazz, with a cognate in Modern Classical Composition and a Bachelor’s in Classical Music Performance, Dr. Reginald Chapman Jr.&nbsp; takes his studied technical dexterity, and filters it through his personal affinity for Hip-Hop beat tapes and experimental Electronic music, utilizing a blend of both to forge a signature sound that’s all his own.&nbsp; It has been that unpretentious, yet outstanding, quality to his work that has made Chapman an increasingly beloved “musician’s musician,” with a loyal following of respected peers, refined jazz appreciators, and beat-heads alike. Chaphouse is the recent Brooklyn based incarnation of his ever continuing musical journey.&nbsp;    Featuring:   Maxx Spinelli  - Bass   Ben Allen  - Piano&nbsp;   Ryan Easter  - Trumpet&nbsp;   CJ McPhatter  - Drums&nbsp;   Reginald Chapman  - Trombone&nbsp;      $20 suggested. Donate here in advance, or during the performance.&nbsp;"
    },
    {
      "image": "https://viewcy-heroku-production.s3.amazonaws.com/courses/featured_images/000/016/409/cover/avi_fox_rosen-face-close-washed-out.jpg?1741738949",
      "eventDate": "Mon,  Jun 23 2025",
      "startTime": "Mon,  Jun 23 2025",
      "endTime": "Mon,  Jun 23 2025",
      "title": "YIDDISH PRIDE NIGHT WITH AVI FOX-ROSEN: THE JOURNEY HOME.",
      "description": "Avi Fox-Rosen     presents  Di rayze aheym  /  The Journey Home     A bilingual song cycle based on the poetry of Irena Klepfisz       In this debut performance, singer/songwriter  Avi Fox-Rosen  sets the bilingual English/Yiddish poetry of  Irena Klepfisz  to music, creating a powerful exploration of displacement, diaspora, queerness, feminism, secular Jewish identity, and memory.   The work bridges traditional Yiddish musical forms with contemporary songwriting, creating a dialogue between past and present to imagine a vibrant future.  Featuring:  -  Avi Fox-Rosen  (voice, guitar)&nbsp;  -  Alicia Svigals  (violin) - Founding member of The Klezmatics and celebrated klezmer violinist.   And Special Guests TBA..&nbsp;       $20 suggested"
    },
    {
      "image": "https://viewcy-heroku-production.s3.amazonaws.com/courses/featured_images/000/017/673/cover/Milagro_Verde_vortex_generic.jpg?1748358154",
      "eventDate": "Mon,  Jun 23 2025",
      "startTime": "Mon,  Jun 23 2025",
      "endTime": "Mon,  Jun 23 2025",
      "title": "TROPICAL VORTEX Presents: MILAGRO VERDE with resident DJs  & Special Guests",
      "description": "TROPICAL VORTEX    is Barbès long-running series showcasing all manners of tropical styles from Latinolandia with live band and DJs playing cumbia, chicha, guaguanco, mambo, plena, Sanjuanitos and other styles of vintage or not so vintage styles.     Past artists include Combo Chimbita, Chicha Libre, Los Cumpleaños, Bulla en el Barrio with appearances by Chico Trujillo, Frente Cumbiero, Los Gaiteros de San Jacinto, Son Palenque, Son Rompe Pera, Paito y los Gaiteros de Punta Brava, Ceferina Banquez, Meridian Brothers, La Perla and many many more..       MILAGRO VERDE  plays Psychedelic cumbia and chicha inspired by the classic sound of Los Mirlos and other 70's bands from the Peruvian Amazon.&nbsp; &nbsp;     Featuring resident&nbsp; DJs Adrian is Hungry and&nbsp; Sonido Chichadelico&nbsp; And special guests tba&nbsp;       $15 suggested - Click Donate to pay in advance     Produced with our friends at Ilegal Mezcal"
    },
    {
      "image": "https://viewcy-heroku-production.s3.amazonaws.com/courses/featured_images/000/017/079/cover/Francis_Jacob_blind_mice.jpg?1745200649",
      "eventDate": "Tue,  Jun 24 2025",
      "startTime": "Tue,  Jun 24 2025",
      "endTime": "Tue,  Jun 24 2025",
      "title": "THREE BLIND MICE",
      "description": "Three Blind Mice   “Three Blind Mice” is an urban trio, city dwellers thriving in the atmosphere of small spaces. The music came to life through daytime and nightime sessions, indoors and outdoors venues in the heart of Brooklyn, NYC.  Playful, poetic and resilient, the “Three Blind Mice” are set to deliver. Tales of illusion, delusion and redemption, brought to you with passion and creativity, the Three Mices are here to take you places.  Born at the dusk of the pandemic, The “Three Blind Mice” is a trio comprised of seasoned musicians, each one with different backgrounds, different origins,  each vibrating with the same vital energy, at the threshold of Jazz and World Music.      The Three Mice:    -    Francis Jacob   &nbsp;   His composition have been twice nominated for a Grammy.&nbsp; Francis’s assertive and multi-layered guitar style has been shaped by years of touring and association with West African artists such as Kine Lam (Senegal), Sekouba Kandia Kouyate (Guinea),&nbsp; King Wemsah (Togo), or Kofo The Wonderman (Nigeria)      - Stomu Taekeishi   &nbsp;Stomu started playing Koto at an early age in his native Japan, and eventually one of New York’s most innovative bass players, performing and recording with a wide variety of musicians, from Paul Motian and Don Cherry, to Badal Roy, Lucia Pulido or Henry Threadgill. Stomu was the winner of Downbeat’s Critic Poll in 2009, for the category of Electric Bass and Rising Star.      - Gintas Janusonis   Known for his infectious groove, his extreme versatility, his innovative and conceptual approach, Gintas is an acclaimed drummer, who has toured and recorded with some of the most iconic musicians of our times, ranging from Carlos Santana and Angélique Kidjo to Eminem and Brandford Marsalis.       $20 suggested. Pay online now or that night in person"
    },
    {
      "image": "https://viewcy-heroku-production.s3.amazonaws.com/courses/featured_images/000/016/725/cover/Slavic_Soul_Party_live_at_barbes.jpg?1743125600",
      "eventDate": "Tue,  Jun 24 2025",
      "startTime": "Tue,  Jun 24 2025",
      "endTime": "Tue,  Jun 24 2025",
      "title": "SLAVIC SOUL PARTY",
      "description": "SLAVIC SOUL PARTY - Every Tuesday. (for ever..)         Fiery Balkan brass, throbbing funk grooves, Roma accordion wizardry, and virtuoso jazz chops: Slavic Soul Party! is just what it says. Brash and strong as slivovitz, these nine musicians have forged a virtuosic new brass band music in the heart of New York City; they have held their Tuesday bacchanal for now 18 years and - and it has become a destination for locals and brass band fans from around the globe.    John Carlson  &amp;  Kenny Warren  (trumpet),  Peter Hess  (sax/clarinet),  Peter Stan  (accordion),  Tim Vaughn  &amp;  Adam Dotson  (trombone),  Ken Bentley  (tuba),  Matt Moran  and  Chris Stromquist  (go/snare/perc).   9pm to midnight."
    },
    {
      "image": "https://viewcy-heroku-production.s3.amazonaws.com/courses/featured_images/000/017/114/cover/Erik_Della_Penna_barbes_web.jpg?1745246531",
      "eventDate": "Wed,  Jun 25 2025",
      "startTime": "Wed,  Jun 25 2025",
      "endTime": "Wed,  Jun 25 2025",
      "title": "Erik Della Penna's BYZANTINE STOMPERS",
      "description": "Erik Della Penna's BYZANTINE STOMPERS   Erik Della Penna’s new project is the future of ancient music.   Byzantine manuscripts and American roots music are used to create concise compositions, and these became the template for this acoustic trio to improvise.&nbsp;  Come hear this archaeological dig into ancient music, carelessly rendered and naively informed by both Mediterranean antiquity and American roots music.   As  Brave New World  is to the future,  Byzantine Stompers  are to the past: Both prophetic and inaccurate.&nbsp;      With Erik Della Penna  - guitars, vocals  // Daisy Castro -  violin  // Wade Schuman -  harmonicas    8pm    $20 suggested&nbsp;"
    },
    {
      "image": "https://viewcy-heroku-production.s3.amazonaws.com/courses/featured_images/000/018/215/cover/Orchestre_Moto.jpg?1750088251",
      "eventDate": "Wed,  Jun 25 2025",
      "startTime": "Wed,  Jun 25 2025",
      "endTime": "Wed,  Jun 25 2025",
      "title": "ORCHESTRE MOTO",
      "description": "ORCHESTRE MOTO - Congolese Rumba.       Led by guitarist Solo De Kanto, originally from Bandundu Province in the Democratic Republic of Congo;  Orchestre Moto  is a band based in New York City that celebrates Congolese music - with a strong emphasis on the classic 70's sound of the likes of Franco's TPOK Jazz and Tabu Ley Rochereau.      Orchestre Moto  was co-founded by rhythm guitarist Julian Apter soon after he started taking lessons with Solo De Kanto. They met while playing together in Nkumu Katalay's Lifelong Project Band, where Julian played as the rhythm guitarist for five years. The group has played at the Sultan Room in Brooklyn and the Shrine is currently recording their first album.&nbsp;       $20 suggested      Donate now or in person that night.&nbsp;"
    },
    {
      "image": "https://viewcy-heroku-production.s3.amazonaws.com/courses/featured_images/000/018/018/cover/Dilara_workshop_pic.jpg?1749671456",
      "eventDate": "Thu,  Jun 26 2025",
      "startTime": "Thu,  Jun 26 2025",
      "endTime": "Thu,  Jun 26 2025",
      "title": "THE RHYTHM OF THE HIPS: A Belly Dance Workshop",
      "description": "Wild Woman Series presents.  The Rhythm of the Hips     A belly dance workshop      The Wild Woman Series is created by Dilara Akpinar, a belly dancer and somatic psychotherapist, with the goal of embarking on a journey that embraces and celebrates our beingness.  The aim of these movement series is to fully inhabit the body and the present moment, filled with expansive emotions such as pain, grief, joy, and pleasure.&nbsp; The body acts as a connection between the conscious and the unconscious, and through movement, help facilitate a&nbsp; transition between states of growth.     In the first of the series, The Rhythm of the Hips, we will explore our divine feminine energy through the timeless art form of belly dance. Starting with breath connection and a warm up, we will progressively introduce hip movement, circular motions, shimmies, locks, arm movement, and more.. We will close the session with a cool-down to gradually decrease our heart rate and stretch our muscles.     All are welcome.     **While it's suggested to bring a shawl or scarf for the hips, it's not mandatory. Please refrain from wearing belts with coins. Wear comfortable clothes that allow free movement and consider bringing a water bottle for hydration!    $20    6pm to 7:30pm"
    },
    {
      "image": "https://viewcy-heroku-production.s3.amazonaws.com/courses/featured_images/000/016/314/cover/LosAliens_Ricardo_Gallo.jpg?1741266914",
      "eventDate": "Thu,  Jun 26 2025",
      "startTime": "Thu,  Jun 26 2025",
      "endTime": "Thu,  Jun 26 2025",
      "title": "LOS ALIENS",
      "description": "Los ALiENs  come from a place where their star radiates directly into their atmosphere creating an environment where hot grooves reproduce like viruses permeating their daily aural landscape. Los ALiENs create sonic explorations energized by rhythms sprouted in the tropics of this third planet, especially around northern South America and the Caribbean.  In November 2022 they released on planet Earth their Long Play “Odd Subjects”. This funky-electric band is led by composer Ricardo Gallo who plays synths and keyboards and features Andrés Jiménez (a.k.a. Dilemastronauta) on drums, Stomu Takeishi on bass, and Sebastián Cruz on guitar. Los ALiENs take refuge in New York City where they have performed across the boroughs.\"   With  Ricardo Gallo  - synths;  Sebastián Cruz  - guitar;  Stomu Takeishi  - bass and  Andres Jimenez  - drums.&nbsp;     $20 suggested     Pay now online or in person that day."
    },
    {
      "image": "https://viewcy-heroku-production.s3.amazonaws.com/courses/featured_images/000/016/964/cover/Screen_Shot_2022-06-28_at_12.08.45.jpg?1744322695",
      "eventDate": "Fri,  Jun 27 2025",
      "startTime": "Fri,  Jun 27 2025",
      "endTime": "Fri,  Jun 27 2025",
      "title": "Oscar Noriega's CROOKED QUARTET",
      "description": "For years, composer and multi-instrumentalist   OSCAR NORIEGA   brought his Crooked Trio to Barbès every Friday from 5 to 7 - which he had conceived as a vehicle for his drumming.  Oscar is back with his crooked ways, but concentrating on his main instruments, alto saxophone and clarinets. The sets will retain the casual vibe of the trio, with a mixture of standards and Oscar's compositions.&nbsp;  Among other things, Oscar Noriega is a member of  Tim Berne’s Snakeoil,Endangered Blood  (Chris Speed, Jim Black, Trevor Dunn),  Boss Tenor  and he co-leads the brass band  Banda De Los Muertos  with Jacob Garchik.&nbsp;  With:  Oscar Noriega  - saxophone and clarinet;  Marta Sanchez  - Piano;  Christopher Tordini  - Bass and  Jason Nazary  - Drums       $20 suggested Donate here in advance or in person during the performance"
    },
    {
      "image": "https://viewcy-heroku-production.s3.amazonaws.com/courses/featured_images/000/017/654/cover/Daguerre_Mario_Riquelme_color_Dots.jpg?1748210066",
      "eventDate": "Fri,  Jun 27 2025",
      "startTime": "Fri,  Jun 27 2025",
      "endTime": "Fri,  Jun 27 2025",
      "title": "COMBO DAGUERRE",
      "description": "COMBO DAGUERRE      Combo Daguerre performs original psychedelic chanson with a mostly Latin crew and a a hybrid style informed by boleros, cumbia, cha chas, French chanson and 1930s surrealism. It is music filled with joy and darkness, deep grooves and dirges, nostalgia and futurism..  With  Olivier Conan  (Chicha Libre) - cuatro, vocals;   Adele Fournet  - keyboards and  Felipe Wurst  - guitar (Banda Chuska/Tipa Tipo);  Neil Ochoa  (Los Crema Paraiso, Chicha Libre) - percussion and  Dan Martinez  - (Mecanica Popular) bass.        $20 suggested      Donate now or in person that night.&nbsp;"
    },
    {
      "image": "https://viewcy-heroku-production.s3.amazonaws.com/courses/featured_images/000/017/818/cover/Gilli_yallo.jpg?1748967405",
      "eventDate": "Fri,  Jun 27 2025",
      "startTime": "Fri,  Jun 27 2025",
      "endTime": "Fri,  Jun 27 2025",
      "title": "GILI YALO",
      "description": "GILI YALO  and his band combine traditional Ethiopian music with Soul, Funk, Psychedelic and Jazz music, accompanied by Gili’s unique voice with lyrics in both English and Amharic.     The music made by Gili Yalo embodies his own personal story, which inspired the rhythm and flow of the whole project. And what a story he has to tell: Operation Moses was the covert evacuation of Ethiopian Jews from Sudan during a famine in 1984. These Ethiopian Jews fled from their native land on foot to refugee camps in Sudan.  Together with his family, Gili Yalo made this perilous trip, walked through the desert towards the “Promised Land” and sang to his beloved ones. In the course of this exhausting and emotional journey, the music encouraged Gili and his family to keep on moving. Gili Yalo’s band is made up of five musicians, including guitar, bass, keyboard, drums, and trumpet. An entrancing rhythmic motion is apparent when listening to Gili’s music, from the groove, beat and flow, and up to the lyrics, concept and style of the project. Today Gili Yalo’s music gives a new meaning to traditional Ethiopian music. The expression of his story through an advanced music production represents his own personal triumph.   Gili Yalo - Vocals / Ran Livneh - Bass / Marco Bolfelli - Guitar / Micha Gilad - Keys / Joseph Daniel Yount - Drums / Sean Smith - Trumpet       $20 s Pay now online or that night in person."
    },
    {
      "image": "https://viewcy-heroku-production.s3.amazonaws.com/courses/featured_images/000/017/597/cover/Joel_Harrison_guitar.jpg?1747856489",
      "eventDate": "Sat,  Jun 28 2025",
      "startTime": "Sat,  Jun 28 2025",
      "endTime": "Sat,  Jun 28 2025",
      "title": "JOEL HARRISON - Saturdays in June",
      "description": "Joel Harrison Guitar Choir    Saturdays in June.      Featuring guitarist  Joel Harrison  in quartet, trio, and duo, celebrating the infinity of the guitar    This week:    Joel Harrison's Stardust Reunion Band    Joel Harrison  (guitars and voice);  Stephan Crump : bass;  Josh Dion : drums, voice    Plus special guests      $20 suggested -&nbsp; Donate online now or in person that day.&nbsp;"
    },
    {
      "image": "https://viewcy-heroku-production.s3.amazonaws.com/courses/featured_images/000/017/819/cover/Eleonore_WEILL.jpg?1748967579",
      "eventDate": "Sat,  Jun 28 2025",
      "startTime": "Sat,  Jun 28 2025",
      "endTime": "Sat,  Jun 28 2025",
      "title": "ELEONORE WEILL",
      "description": "Éléonore Weill   Jewish French singer and multi-instrumentalist   Eléonore Weill   performs polyphonic singing,  Klezmer and Occitan dance tunes, original, old, traditional, well-known and forgotten songs of resistance, peace, justice and love in French, Occitan and Yiddish.    $20 suggested -&nbsp; Donate online now or in person that day.&nbsp;"
    },
    {
      "image": "https://viewcy-heroku-production.s3.amazonaws.com/courses/featured_images/000/017/177/cover/Choro_Jam.jpg?1745499650",
      "eventDate": "Sun,  Jun 29 2025",
      "startTime": "Sun,  Jun 29 2025",
      "endTime": "Sun,  Jun 29 2025",
      "title": "CLUBE DO CHORO with REGIONAL SAMAUMA",
      "description": "Fernanda Silveira   leads a weekly Choro jam in our front room with Regional Samauma and special guests. A casual affair with  virtuosos.     Fernanda Silveira  is a cavaquinho player specializing in the Brazilian practices of choro and traditional samba. She is a disciple of Luciana Rabello and has accompanied many artists including guitarists Maurício Carrilho, Yamandu Costa and Zé Barbeiro, clarinetist Nailor Proveta, mandolinists Pedro Amorim and Miltinho Mori, as well as Ronaldo do Bandolim and Jorginho do Pandeiro.&nbsp;      $15 suggested      donate in advance or pay in person.&nbsp;"
    },
    {
      "image": "https://viewcy-heroku-production.s3.amazonaws.com/courses/featured_images/000/016/360/cover/Will_Holshouser.jpg?1741457064",
      "eventDate": "Sun,  Jun 29 2025",
      "startTime": "Sun,  Jun 29 2025",
      "endTime": "Sun,  Jun 29 2025",
      "title": "WILL HOLSHOUSER",
      "description": "WILL HOLSHOUSER     Solo accordion   Will has played with a wide variety of artists including violinist Regina Carter, clarinetist David Krakauer, trumpet phenomenon Eric Vloeimans, Suzanne Vega, Antony and the Johnsons, Michael Winograd, Uri Caine, Martha, Loudon Wainwright III and many others. Three albums of his own music for trio have been released by the Portuguese label Clean Feed. His group Musette Explosion, a collaboration with Matt Munisteri on guitar and Marcus Rojas on tuba, made it to Billboard’s Jazz Albums chart and was featured in an interview on  NPR’s  Fresh Air  .       7pm     $15 suggested&nbsp;"
    },
    {
      "image": "https://viewcy-heroku-production.s3.amazonaws.com/courses/featured_images/000/016/400/cover/716bfb_20096fc6710b4937a13f56c067d52ffc_mv2.jpg?1741712710",
      "eventDate": "Sun,  Jun 29 2025",
      "startTime": "Sun,  Jun 29 2025",
      "endTime": "Sun,  Jun 29 2025",
      "title": "MIKE LAVALLE",
      "description": "MIKE LAVALLE       Bassist and composer  Michael LaValle  presents his latest project at Barbes, featuring new works performed alongside Caroline Davis on alto saxophone,  Danny Fox  on piano, and  Bill Campbell  on drums.      $20 suggested"
    },
    {
      "image": "https://viewcy-heroku-production.s3.amazonaws.com/courses/featured_images/000/017/912/cover/People_of_Earth_pic.jpg?1749313270",
      "eventDate": "Sun,  Jun 29 2025",
      "startTime": "Sun,  Jun 29 2025",
      "endTime": "Sun,  Jun 29 2025",
      "title": "PEOPLE OF EARTH",
      "description": "People of Earth  brings the fire with irresistible  timba  grooves,  Afro-Caribbean rhythms , and global dance floor energy. Come ready to move—this is music that  demands  you dance.       With  Gabriel Globus-Hoenich -percussion, director  Victor Pablo -percussion  Arthur Torres -Sax/Keyboard  Raul Rios -Voice/Trumpet  Hilaria Despagna -Voice/Trombone  Alberto Miranda -Bass  Ahmed Alom -Piano  Ivan Llanes -Voice       this show is free"
    },
    {
      "image": "https://viewcy-heroku-production.s3.amazonaws.com/courses/featured_images/000/017/713/cover/Dana_Kyle_2025.jpg?1748468082",
      "eventDate": "Mon,  Jun 30 2025",
      "startTime": "Mon,  Jun 30 2025",
      "endTime": "Mon,  Jun 30 2025",
      "title": "DANA LYN & KYLE SANNA",
      "description": "Dana Lyn &amp; Kyle Sanna  :     A \"Through the Looking Glass\" approach to traditional Irish music.      Hailed as “first-rate, versatile musicians” by  The New Yorker  and “a top-notch fiddle-and-guitar duo” by  The New York Times , Dana Lyn and Kyle Sanna connect the dots between their experience as composers and improvisers in New York City’s rich musical community and their deep admiration for traditional Irish music. The duo has collaborated with some of the greatest interpreters of the Irish tradition, including Martin Hayes and Dennis Cahill, Cillian Vallely, Kevin Burke, Mick McAuley, and Seamus Egan. The duo’s music will be featured in the upcoming Ken Burns film  The American Revolution .    Since 2015 their projects have been focused on themes of environmental fragility. “The Great Arc” and “The Coral Suite” celebrate biodiversity through Lyn’s artwork, while also highlighting pressing environmental issues, and their work for string orchestra, “Under the Sea-Wind”, amplifies Rachel Carson’s message that the health of the planet rests on the balance of relationships between life and the cycles of nature.     Brooklyn-based multi-instrumentalist and composer   Dana Lyn   has collaborated with Stew, Ethan Hawke, Vincent D’Onofrio, Heather Christian, Susan McKeown, Mick Moloney, Taylor Mac, Brooklyn Rider,&nbsp; and the Apple Hill String Quartet. One of her favorite things to do is to write music for her friends and then play that music with them at Barbes.  Guitarist   Kyle Sanna’s   diverse musical practice includes composition, improvisation, the recording studio, live coding, and the traditional music of Ireland. He performs regularly with Kinan Azmeh, Maeve Gilchrist, Seamus Egan, and Martin Hayes. WNYC’s  New Sounds  and  Sound Check  host John Schaefer called his music “unconventionally beautiful.”     7pm    $20 suggested.&nbsp; Pay now online or that night in person.&nbsp;"
    },
    {
      "image": "https://viewcy-heroku-production.s3.amazonaws.com/courses/featured_images/000/017/672/cover/ELVIRA_VORTEX.jpg?1748358111",
      "eventDate": "Mon,  Jun 30 2025",
      "startTime": "Mon,  Jun 30 2025",
      "endTime": "Mon,  Jun 30 2025",
      "title": "TROPICAL VORTEX presents ELVIRA Y LA TRIETNIA",
      "description": "TROPICAL VORTEX    is Barbès long-running series showcasing all manners of tropical styles from Latinolandia with live band and DJs playing cumbia, chicha, guaguanco, mambo, plena, Sanjuanitos and other styles of vintage or not so vintage styles. Past artists include Combo Chimbita, Chicha Libre, Los Cumpleaños, Bulla en el Barrio with appearances by Chico Trujillo, Son Rompe Pera, Paito y los Gaiteros de Punta Brava, Ceferina Banquez and many many more..     ELVIRAy la TriEtnia\"  Colombian Caribbean Folk &amp; POP-Roc     Elvira y la TriEtnia\" infuses Latin poprand Rock with diverse elements from Colombian folklore. Drawing primarily from indigenous rhythms of the Caribbean coast, such as sones de negros, cumbia, bullerengue, chandé, gaita, fandango, porro, and merecumbé among other popular Caribbean sounds. In doing so, it represents the tri-ethnicity that defines her as a global woman.     Alberto Fontes  - Guitarra eléctrica;  Juan Sebastián Monsalve  - bajo;   Víctor Babilonia  - batería;  Derian Pallares  - Tambor alegre and:  Elvira Bustamante  - Voz y maracas      With resident DJ's SONIDO CHICHADELICO and ADRIAN IS HUNGRY and Special Guests   &nbsp;     $15 suggested&nbsp; Pay now online or in person that night.&nbsp;  PRODUCED WITH OUR FRIENDS AT ILEGAL MEZCAL"
    },
    {
      "image": "https://viewcy-heroku-production.s3.amazonaws.com/courses/featured_images/000/018/038/cover/Barbe_CC_80s_Cine_CC_81ma.PNG.jpg?1749692608",
      "eventDate": "Thu,  Jul 03 2025",
      "startTime": "Thu,  Jul 03 2025",
      "endTime": "Thu,  Jul 03 2025",
      "title": "BARBÈS CINEMA",
      "description": "BARBÈS CINEMA   The monthly Barbès screening series has returned! Join us on the first Thursday of every month to watch local, independent films curated in house. Featuring established and new filmmakers, Barbès Cinéma brings you everything left out of commercial film spaces.   This month , stand up takes the stage with two short films exploring performance and fourth-wall breaking comedy. First,   THE WORST FUCKING DAY OF MY LIFE , directed by  Idris Pickél , tackles the frenetic life of a twenty-something wannabe screenwriter, swerving between the absurd and the philosophical.  Then,   ALLAN ANDERS: LIVE AT THE COMEDY CIRCLE - CIRCA 1987 , directed by  Laura Moss , renders comedian  Allan Anders ’ seminal work on the big screen, capturing his famous Comedy Circle performance for the first time.    7:30pm   Suggested donations"
    },
    {
      "image": "https://viewcy-heroku-production.s3.amazonaws.com/courses/featured_images/000/018/030/cover/!Jack_Grace-E017.jpg?1749683020",
      "eventDate": "Sat,  Jul 05 2025",
      "startTime": "Sat,  Jul 05 2025",
      "endTime": "Sat,  Jul 05 2025",
      "title": "JACK GRACE BAND",
      "description": "Jerry Lee Lewis once dubbed   Jack Grace   “that Cash kid, but good” and Jack has enjoyed a long and varied career. The singer, songwriter, and guitarist has been touring and recording for over 25 years. His duet with Norah Jones, “Bad Wind Blowing” was a standout tune on his last recording,  Everything I Say Is A Lie , produced by Joan Jett and Steve Earle’s former guitarist Eric Ambel. He’s performed with a diverse collection of artists, like the aforementioned Lewis as well as Doc Watson, Fishbone and Junior Brown.   His latest album, \"What A Way To Spend A Night\",&nbsp; came out this last summer      $20 suggested"
    },
    {
      "image": "https://viewcy-heroku-production.s3.amazonaws.com/courses/featured_images/000/017/181/cover/Yotoco_pic.jpg?1745505507",
      "eventDate": "Sat,  Jul 12 2025",
      "startTime": "Sat,  Jul 12 2025",
      "endTime": "Sat,  Jul 12 2025",
      "title": "YOTOCO",
      "description": "Yotoco  is a NYC-based band that plays original Latin-American music. Yotoco draws from the traditions of Cuban Rumba and Son, Colombian Cumbia and Puerto Rican Jibaro Music and Plena to create something unique and danceable.  Sebastian Lopez  on bass and voice;  Natalia Perez  on Guiro, Clave and Voice;  Gabo Tomassini  on Congas,  Rubén Coca.  on American drum kit; and  Geovani Caldero  on Puerto Rican Cuatro. Yotoco is named after the town Yotoco, Colombia.       $20 suggested Donate now or in person that day"
    },
    {
      "image": "https://viewcy-heroku-production.s3.amazonaws.com/courses/featured_images/000/017/736/cover/Los_cumplean_CC_83os_viewcy.jpg?1748546429",
      "eventDate": "Fri,  Jul 18 2025",
      "startTime": "Fri,  Jul 18 2025",
      "endTime": "Fri,  Jul 18 2025",
      "title": "TROPICAL VORTEX presents: LOS CUMPLEAÑOS",
      "description": "LOS CUMPLEANOS     Los Cumpleaños play a psychedelic take on classic Colombian Cumbia, Porro, Son Caribeño, Salsa Criolla and Bullerengue. The band has the playfulness of an experimental group and the energy of a punk rock band. They mix new wave synths &amp; retro organ sounds with effect-laden trombone and trumpet as well as a three piece percussion section. Cumpleaños features virtuoso percussionist/vocalist  Nestor Gomez  from Barranquilla, Colombia,  Lautaro Burgos  from Chaco, Argentina on drumset as well as  Eric Lane  on Keyboards and  Alex Asher  on Trombone from the USA. The members of Los Cumpleaños have played with a variety of notable artists including: Anibal Velazquez, Lizandro Meza, Juan Piña, Alfredo Gutierrez, MAKU Soundsystem, Beyoncé, Joan as Police Woman and People's Champ       $20 suggested  Pay now online or in person that night.&nbsp;"
    },
    {
      "image": "https://viewcy-heroku-production.s3.amazonaws.com/courses/featured_images/000/017/667/cover/Kenny_warren_sweet_world.jpg?1748304793",
      "eventDate": "Mon,  Jul 21 2025",
      "startTime": "Mon,  Jul 21 2025",
      "endTime": "Mon,  Jul 21 2025",
      "title": "KENNY WARREN'S SWEET WORLD",
      "description": "Kenny Warren's Sweet World     Trumpeter Kenny Warren's trio plays music from their 2024 release on Out of Your Head Records. \"Non-stop eccentricity and rhythmically complex music, all while achieving a fleet-footed and airy spirit…. simultaneously free-flowing and absolutely thrilling” (NYC Jazz Record).   Featuring  Nathan Ellman-Bell  - drums;&nbsp;  Christopher Hoffman &nbsp; - cello and  Kenny Warren  - trumpet.&nbsp;      $20    Pay online now, or in person that day.&nbsp;"
    },
    {
      "image": "https://viewcy-heroku-production.s3.amazonaws.com/courses/featured_images/000/017/029/cover/VINNIE_SPERRAZZA_NEW_OLD_TIMERS.jpg?1744812445",
      "eventDate": "Tue,  Jul 22 2025",
      "startTime": "Tue,  Jul 22 2025",
      "endTime": "Tue,  Jul 22 2025",
      "title": "NEW OLD TIMERS",
      "description": "NEW OLD TIMERS    Traditional folk and fiddle tunes through the lens of Ornette Coleman     With   Petr Cancura : tenor saxophone, banjo, vocals   Jeremy Udden : alto, C-melody, and baritone saxophone   Aryeh Kobrinsky : bass   Vinnie Sperrazza : drums       $20 suggested Donate here in advance or in person during the performance"
    },
    {
      "image": "https://viewcy-heroku-production.s3.amazonaws.com/courses/featured_images/000/017/549/cover/Judith_Jermiah.jpg?1747753633",
      "eventDate": "Wed,  Jul 30 2025",
      "startTime": "Wed,  Jul 30 2025",
      "endTime": "Wed,  Jul 30 2025",
      "title": "JEREMIAH LOCKWOOD AND JUDITH BERKSON: Voices from the Khazones Underground",
      "description": "Jeremiah Lockwood and Judith Berkson    Voices from the Khazones Underground     Khazones  is the Yiddish term for the work of a special kind of artist that once played an integral role in the Jewish community—the spiritual music virtuoso who represented the community through a style of vocal music that was deeply desired and legible to listeners as a mirror to the soul of the collective. The style of great cantorial voices of the gramophone era captured an imagined folklore, preserving sounds of the rapidly disappearing Eastern European Jewish world. In this presentation, Berkson and Lockwood share new work drawing on the early 20th century cantorial tradition.       $20 suggested. Donate now online or that night in person."
    },
    {
      "image": "https://viewcy-heroku-production.s3.amazonaws.com/courses/featured_images/000/016/499/cover/Campilongo_4_TET_good__copy_3.jpg?1742232523",
      "eventDate": "Wed,  Jul 30 2025",
      "startTime": "Wed,  Jul 30 2025",
      "endTime": "Wed,  Jul 30 2025",
      "title": "JIM CAMPILONGO 4-TET",
      "description": "Be aware that a ticket does not guarantee a seat, just admission - we have very few seats. You may have to stand..      Jim Campilongo's 4 Tet   is driven by long time Brooklyn collaborators  Luca Benedetti  (Ron Carter Steve Gadd),  Andy Hess  (John Scofield, Gov't Mule) and  Dan Rieser  who all bring their sound and style to create a unique distilled power. Their chemistry, focus and mutual admiration is apparent in making this musical unit sound like a joyous army.    With fourteen albums of original material and guest appearances on dozens of recordings -- from the Bammie-winner's contribution on Cake's million-selling Prolonging the Magic to (most recently) doing lead guitar duties with The Little Willies, his band with Norah Jones -- Campilongo has played with JJ Cale, Al Anderson, Gillian Welch/David Rawlings, Peter Rowan, Martha Wainwright, Bright Eyes, Teddy Thompson, and Burning Spear to name a few, has earned two Gold records, and has written music for national ads for National Grid, Volkswagen, SBC, Michelin and Jack Daniel's     Campilongo also had repeat appearances on The Late Show with David Letterman, Late Night with Conan O'Brien, Later . . . with Jools Holland (BBC), Abbey Road Sessions (BBC), and has been interviewed on many major radio shows.&nbsp;      Billboard Magazine  calls Jim Campilongo \"an American treasure\", an accolade which this guitarist's artistry and influential career has richly earned him and the  New Yorker  says \"There it was again: the stinging treble, the spooky overtones, the strings snapping and booming under his hands the sound of a Tele being played as skillfully and exuberantly as it can be played it sounded like nothing and nobody else sounded like Jim Campilongo.\"\\     8pm    $20 - general admission Be aware that a ticket does not guarantee a seat, just admission - we have very few seats.&nbsp;"
    },
    {
      "image": "https://viewcy-heroku-production.s3.amazonaws.com/courses/featured_images/000/016/868/cover/The_point_ATZ.jpg?1744063207",
      "eventDate": "Thu,  Jul 31 2025",
      "startTime": "Thu,  Jul 31 2025",
      "endTime": "Thu,  Jul 31 2025",
      "title": "THE POINT",
      "description": "The Point, a classic trio from Austin, TX, mixes influences ranging from Ethiopian Jazz, desert blues, dub, psych, Thai Molam, and avant-garde touches.   This small but mighty sonic ensemble symbolizes the vibrant voyage of psychedelic beat music from around the wrold with a western approach. &nbsp;     They released Berto's Banquet (EP) in 2022 and a full length album  Maldito Animal  in May of 2024.    With: Jack Montesinos,&nbsp; Joe Roddy and Nico Léophonte&nbsp;      $20 suggested      Pay online now or later in person"
    },
    {
      "image": "https://viewcy-heroku-production.s3.amazonaws.com/courses/featured_images/000/017/867/cover/Dahlia_Blue_pic.jpg?1749151844",
      "eventDate": "Fri,  Aug 01 2025",
      "startTime": "Fri,  Aug 01 2025",
      "endTime": "Fri,  Aug 01 2025",
      "title": "THE BLUE DAHLIA",
      "description": "The Blue Dahlia   - waltz and chanson française meets reggae, soul, Americana, dancehall, punk-klezmer and tango-ska, for a high-energy, international musical joyride. Brooklyn-born singer-songwriter and ukulele-ist Dahlia Dumont, currently living in Paris, France, but returns home regularly and tours with her original NYC band - Texas accordionist and trombonist George Saenz, Venezuelan drummer Joshua Castillo, and Japanese bassist Yoshiki Yamada, plus special guests from The Blue Dahlia family!    $20 suggested - donate in advance or in person"
    },
    {
      "image": "https://viewcy-heroku-production.s3.amazonaws.com/courses/featured_images/000/017/502/cover/BUCK_AND_A_QUARTER.jpg?1747429476",
      "eventDate": "Sun,  Aug 03 2025",
      "startTime": "Sun,  Aug 03 2025",
      "endTime": "Sun,  Aug 03 2025",
      "title": "BUCK AND A QUARTER QUARTET",
      "description": "Founded in 2014,   Buck And A Quarter Quartet   was started by five friends who wanted to play the forgotten gems of the golden age of American popular music as a string band. They cover vintage pop, western swing, traditional jazz, tangos, and vintage-inspired originals, all in a category-defying style described as ‘skiffle meets Cole Porter’ and ‘what kind of music IS this?’     Buck And A Quarter has been playing for dancing and listening at venues all over New York City and the northeast. Our line-up includes Brian Nalepka (gut-string bass and tuba), Mike Weatherly (plectrum guitar, banjo, and gut-string bass), John Bianchi (clarinet and saxes), John “Sir Scratchy” Landry (violin), Chris Bannon (tenor banjo), Angus Loten (tenor guitar and percussion), and Ben Mealer (national steel ukulele and tiple).    $20 suggested -&nbsp; Donate online now or in person that day.&nbsp;"
    },
    {
      "image": "https://viewcy-heroku-production.s3.amazonaws.com/courses/featured_images/000/017/064/cover/sam_nathan_faces___instruments___glare_behind_nathan.jpg?1744989461",
      "eventDate": "Sat,  Aug 09 2025",
      "startTime": "Sat,  Aug 09 2025",
      "endTime": "Sat,  Aug 09 2025",
      "title": "SAM SADIGURSKY and NATHAN KOCI: SOLOMON DIARIES",
      "description": "SAM SADIGURSKY and NATHAN KOCI:    SOLOMON DIARIES     *Album release show*      Clarinetist  Sam Sadigursky  and accordionist   Nathan Koci   celebrate the release of the next two volumes of  The Solomon Diaries series on , featuring special guest musicians from the album.&nbsp;      Sam Sadigursky  was featured onstage in the Tony and Grammy Award winning The Band's Visit and most recently joined the Philip Glass Ensemble. He's also played with Fred Hersch, Brad Mehldau, and the Mingus Orchestra.      Nathan Koci  is an acordionist, multi-instrumentalist, and music director that most recently worked with Justin Peck and Jackie Sibbles Drury on Sufjan Stevens’ ILLINOISE on Broadway. He has also performed with William Kentridge, Dana Lyn, Guy Klucevsek, and Ray Charles.&nbsp;     “Such poignance that your heart may be buoyed rather than broken” - Will Layman, PopMatters     “A monumental achievement… In Sadigursky’s musical vision, new music, folk, jazz, chamber music, and Klezmer blend into a unique and highly personal cross-genre hybrid. The interplay between the duet partners is strikingly telepathic… In its totality, the instrumental cycle addresses the 20th century Jewish experience, but its spirit is generous and open enough to reflect that of any population of immigrants and refugees, transcending the particular to address the promises of the American dream, both realized and broken.” - Seth Rogovoy, Chronogram     With  Sam Sadigursky  (clarinet);  Nathan Koci  (accordion) and special guests.&nbsp;      $20 suggested&nbsp;    Pay now online or in person that night&nbsp;"
    },
    {
      "image": "https://viewcy-heroku-production.s3.amazonaws.com/courses/featured_images/000/017/697/cover/guachinangos_new.jpg?1748441442",
      "eventDate": "Sat,  Aug 09 2025",
      "startTime": "Sat,  Aug 09 2025",
      "endTime": "Sat,  Aug 09 2025",
      "title": "GUACHINANGOS",
      "description": "GUACHINANGOS.      Folk fusion from another dimension, Guachinangos fuses son jarocho, cumbia, champeta and other rhythms with an irresistible swing. A mix of traditional and electric instrumentation makes for particularly vibrant shows, which are part dance party and part community gatherings.   With  Juan Carlos Marin  - requinto jarocho, voice;&nbsp;  Gabriella Grimaldi  - violin, voice;  Alberto Fontes  - electric guitar, jarana;  Victor Babilonia  - drums;  Elvira Bustamante  - maracas, voice, dance;  Leo Catricala  - bass;  Inka Ortiz  - tambor alegre.     $20 suggested Pay now online or that day in person,"
    },
    {
      "image": "https://viewcy-heroku-production.s3.amazonaws.com/courses/featured_images/000/017/773/cover/Jeff_Rum.jpg?1748803297",
      "eventDate": "Mon,  Aug 18 2025",
      "startTime": "Mon,  Aug 18 2025",
      "endTime": "Mon,  Aug 18 2025",
      "title": "JEFF RUM (ft. Ryan Dugre, Jeremy Gustin, and James Buckley)",
      "description": "JEFF RUM  (ft. Ryan Dugre, Jeremy Gustin, and James Buckley      Jeff Rum is an instrumental guitar trio featuring  Ryan Dugre, Jeremy Gustin and James Buckley , performing interpretations of music from all over the globe. From Henry Mancini soundtracks and Brazilian Choro to Israeli psych-rock and Icelandic jazz, the group’s unique interplay creates a unifying playful sound that connects it all.   Ryan Dugre  is a New York-based guitarist and composer. His newest EP “Look See” is an exploration of the tenor guitar, out on Ruination Records.   Jeremy Gustin  is a drummer, composer, and producer. Working with an array of different artists from Brazil to Japan. A Brooklyn resident can be found playing free improv as often as song-based music.&nbsp;     James Buckley  has been seen or heard with such great artists as Tim Sparks, Dessa, Gayngs, Lizzo, P.O.S, Bon Iver, Harmar Superstar, DOSH, Dave King(Bad Plus), David Murray, Kahil El’Zabar, and more. Currently located in Brooklyn, New York, James now heads up the programming and curation at The Sultan Room.    $20 suggested.  Donate online now or in person that night.&nbsp;"
    },
    {
      "image": "https://viewcy-heroku-production.s3.amazonaws.com/courses/featured_images/000/017/081/cover/BOMBAY_RICKEY-8113_V3-1900x1267.jpg?1745238642",
      "eventDate": "Sat,  Aug 23 2025",
      "startTime": "Sat,  Aug 23 2025",
      "endTime": "Sat,  Aug 23 2025",
      "title": "BOMBAY RICKEY",
      "description": "BOMBAY RICKEY    Fronted by vocalist and composer  Kamala Sankaram , Bombay Rickey counts Ennio Morricone and Yma Sumac as influences and could very well be the soundtrack to a 1960s Bollywood western. Bombay Rickey mixes surf rock, cumbia and coloratura soprano - without resorting to pastiche.    Bombay Rickey was invited to create an opera cabaret based on the life of Yma Sumac for the prestigious PROTOTYPE Festival in New York City. The show ran for seven sold-out performances and was hailed as a “rocking musical show” by the Wall Street Journal.   Featuring :  Kamala Sankaram  - vocals;  Drew Fleming  - guitar;   Jeff Hudgins  - saxophones;  Nick Cudahy  - bass and  Brian Adler  -drums&nbsp;       $20 suggested. Donate online now or in person that night.&nbsp;"
    },
    {
      "image": "https://viewcy-heroku-production.s3.amazonaws.com/courses/featured_images/000/017/182/cover/Yotoco_pic.jpg?1745505543",
      "eventDate": "Fri,  Aug 29 2025",
      "startTime": "Fri,  Aug 29 2025",
      "endTime": "Fri,  Aug 29 2025",
      "title": "YOTOCO",
      "description": "Yotoco  is a NYC-based band that plays original Latin-American music. Yotoco draws from the traditions of Cuban Rumba and Son, Colombian Cumbia and Puerto Rican Jibaro Music and Plena to create something unique and danceable.  Sebastian Lopez  on bass and voice;  Natalia Perez  on Guiro, Clave and Voice;  Gabo Tomassini  on Congas,  Rubén Coca.  on American drum kit; and  Geovani Caldero  on Puerto Rican Cuatro. Yotoco is named after the town Yotoco, Colombia.       $20 suggested Donate now or in person that day"
    },
    {
      "image": "https://viewcy-heroku-production.s3.amazonaws.com/courses/featured_images/000/017/077/cover/BillCarney'sJugAddicts.jpg?1745190371",
      "eventDate": "Sat,  Aug 30 2025",
      "startTime": "Sat,  Aug 30 2025",
      "endTime": "Sat,  Aug 30 2025",
      "title": "BILL CARNEY'S JUG ADDICTS",
      "description": "Frontman Bill Carney has been leading various jug bands for close to three decades, including his Brooklyn-based JugAddicts who have been a regular presence in our backroom for two of those decades.  A large formation with a rotating cast of a musicians,&nbsp; the JugAddicts are characterized by their powerful, raucous approach to jug band, old time, tin pan alley, early jazz and blues repertoire   Bill Carney : lead washboard, vocals, kazoo;  Karl Meyer -  violin, vocals;  Brian Mulroney -  rhythm washboard, vocals;&nbsp;  Steve Cooney -  slide guitar;  Jerry Fabris -  double bass, vocals;  Seth Kessel  - guitar&nbsp;      $20 suggested Donate now or in person that day"
    },
    {
      "image": "https://viewcy-heroku-production.s3.amazonaws.com/courses/featured_images/000/017/163/cover/Reed_Basket_-_heart_by_Stephanie_Berger.jpg?1745419780",
      "eventDate": "Sun,  Aug 31 2025",
      "startTime": "Sun,  Aug 31 2025",
      "endTime": "Sun,  Aug 31 2025",
      "title": "REED BASKET",
      "description": "Reed Basket  is an all-clarinet all-the-time quartet, with  Andy Biskin, Peter Hess, Mike McGinnis , and  Sam Sadigursky .   The group plays original compositions as well as arrangements of songs by composers including Mozart, John Lennon, Jelly Roll Morton, Horace Silver, and Lou Reed.&nbsp;      Reed Basket Plays Schubert's    Moment Musicaux    #3 (Op. 94)      “While the clarinet may not be experiencing a full-bore resurgence, it certainly appears in jazz circles with increasing frequency these days. Biskin was ahead of the curve, long gifted at balancing his musical-Americana fixation with side trips into regions unexplored. Biskin fronts an assembly of idiosyncratic small groups, including the similarly inclined clarinet quartet  Reed Basket .”&nbsp; –The New Yorker       $20 suggested Donate here in advance or in person during the performance"
    },
    {
      "image": "https://viewcy-heroku-production.s3.amazonaws.com/courses/featured_images/000/017/499/cover/Dana_Kurtz.jpg?1747427610",
      "eventDate": "Mon,  Sep 08 2025",
      "startTime": "Mon,  Sep 08 2025",
      "endTime": "Mon,  Sep 08 2025",
      "title": "DAYNA KURTZ",
      "description": "Over the past decade, the New Jersey born, now New Orleans resident   Dayna Kurtz   -  a vocalist. writer. musician and producer - has been bestowed with many awards and praises, including being named the Female Songwriter of the Year by the National Academy of Songwriters. Norah Jones and Bonnie Raitt have raved about her in interviews, and she’s toured as an opening act for the likes of Elvis Costello, Richard Thompson, Mavis Staples, Rufus Wainwright, B.B. King, Dr. John, Richie Havens, Keren Ann, Chris Whitley, and the Blind Boys of Alabama.&nbsp; Her last studio record, “Rise and Fall” was nominated for 5 Offbeat Magazine Awards.     7pm    $20 . Pay now online or in person that day. '"
    },
    {
      "image": "https://viewcy-heroku-production.s3.amazonaws.com/courses/featured_images/000/017/623/cover/HELEN_GILLET_Greg_Miles.jpg?1747949229",
      "eventDate": "Tue,  Sep 09 2025",
      "startTime": "Tue,  Sep 09 2025",
      "endTime": "Tue,  Sep 09 2025",
      "title": "HELEN GILLET",
      "description": "Helen Gillet   is a Belgian-born cellist, singer, composer, improviser and producer who grew up in Singapore, Chicago and Wisconsin before moving to New Orleans in 2002. Her eclectic palette includes avant-garde jazz, French chansons, funk, alternative rock, and the bohemian flair of the Velvet Underground. Helen tours extensively with her solo performance which is known for its enigmatic quality, improvisational versatility and a true mastery of live looping technology, on par with artists Andrew Bird and Matt Chamberlain. She has recorded, toured and performed with a wide array of musicians including Jason Marsalis, Kid Koala, Dr. John, Arcade Fire, Steve Earle, Iron and Wine, Marianne Faithful, Psychedelic Furs, Bill Summers, Cassandra Wilson, Johnny Vidacovich etc.        $15 Tickets"
    },
    {
      "image": "https://viewcy-heroku-production.s3.amazonaws.com/courses/featured_images/000/017/737/cover/Los_cumplean_CC_83os_viewcy.jpg?1748546494",
      "eventDate": "Fri,  Sep 12 2025",
      "startTime": "Fri,  Sep 12 2025",
      "endTime": "Fri,  Sep 12 2025",
      "title": "TROPICAL VORTEX presents: LOS CUMPLEAÑOS",
      "description": "LOS CUMPLEANOS     Los Cumpleaños play a psychedelic take on classic Colombian Cumbia, Porro, Son Caribeño, Salsa Criolla and Bullerengue. The band has the playfulness of an experimental group and the energy of a punk rock band. They mix new wave synths &amp; retro organ sounds with effect-laden trombone and trumpet as well as a three piece percussion section. Cumpleaños features virtuoso percussionist/vocalist  Nestor Gomez  from Barranquilla, Colombia,  Lautaro Burgos  from Chaco, Argentina on drumset as well as  Eric Lane  on Keyboards and  Alex Asher  on Trombone from the USA. The members of Los Cumpleaños have played with a variety of notable artists including: Anibal Velazquez, Lizandro Meza, Juan Piña, Alfredo Gutierrez, MAKU Soundsystem, Beyoncé, Joan as Police Woman and People's Champ       $20 suggested  Pay now online or in person that night.&nbsp;"
    },
    {
      "image": "https://viewcy-heroku-production.s3.amazonaws.com/courses/featured_images/000/016/482/cover/2824_Mat_Maneri_Lucian_Ban_PF1.jpg?1742144151",
      "eventDate": "Sat,  Sep 13 2025",
      "startTime": "Sat,  Sep 13 2025",
      "endTime": "Sat,  Sep 13 2025",
      "title": "Lucian Ban and Mat Maneri: TRANSYLVANIAN DANCE",
      "description": "TRANSYLVANIAN DANCE      When Romanian-born pianist   Lucian Ban   and Grammy-nominated violinist   Mat Maneri   joined up for a concert in an opera house in Lucian's hometown of Targu Mures in the middle of Romania's Transylvania region, the music was, as Jazz Times puts it, “as close as it gets to Goth jazz\" Released in 2013 as a live album by ECM Records, the Transylvanian Concert has won critical acclaim on both sides of the Atlantic and has spawned several tours.   Their follow up album,  Transylvanian Dance,  is also being released by ECM.   8pm   $20 Tickets"
    },
    {
      "image": "https://viewcy-heroku-production.s3.amazonaws.com/courses/featured_images/000/017/161/cover/Maritzaida.jpg?1745416157",
      "eventDate": "Fri,  Sep 19 2025",
      "startTime": "Fri,  Sep 19 2025",
      "endTime": "Fri,  Sep 19 2025",
      "title": "MARITZAIDA: La Música de Sylvia Rexach y Tutti Umpierre",
      "description": "Maritzaida: La Música de Sylvia Rexach y Tutti Umpierre       Maritzaida  is a Puerto Rican vocalist hailed for reviving the timeless boleros of  Sylvia Rexach  in collaboration with her husband, guitarist  AJ Weibe , who draws inspiration from the distinct style of  Tutti Umpierre .  A torchbearer of  música bohemia , she works closely with Rexach’s daughter, Sharon Riley Rexach, to record unpublished and long-lost compositions as they were originally intended. Her 2024 album  Alma Adentro  was named one of the Top 20 Most Outstanding Albums in Puerto Rico. She is part of  Charlie Hunter 's record label,  SideHustle Records.      8pm $20 Purchase tickets online or in person that day"
    },
    {
      "image": "https://viewcy-heroku-production.s3.amazonaws.com/courses/featured_images/000/017/698/cover/guachinangos_new.jpg?1748441524",
      "eventDate": "Fri,  Sep 19 2025",
      "startTime": "Fri,  Sep 19 2025",
      "endTime": "Fri,  Sep 19 2025",
      "title": "GUACHINANGOS",
      "description": "GUACHINANGOS.      Folk fusion from another dimension, Guachinangos fuses son jarocho, cumbia, champeta and other rhythms with an irresistible swing. A mix of traditional and electric instrumentation makes for particularly vibrant shows, which are part dance party and part community gatherings.   With  Juan Carlos Marin  - requinto jarocho, voice;&nbsp;  Gabriella Grimaldi  - violin, voice;  Alberto Fontes  - electric guitar, jarana;  Victor Babilonia  - drums;  Elvira Bustamante  - maracas, voice, dance;  Leo Catricala  - bass;  Inka Ortiz  - tambor alegre.     $20 suggested Pay now online or that day in person,"
    },
    {
      "image": "https://viewcy-heroku-production.s3.amazonaws.com/courses/featured_images/000/017/231/cover/Beyza_portrait_Randalls.jpg?1745931347",
      "eventDate": "Sat,  Sep 20 2025",
      "startTime": "Sat,  Sep 20 2025",
      "endTime": "Sat,  Sep 20 2025",
      "title": "BEYZA YAZGAN Plays BACH'S COMPLETE GOLDBERG VARIATIONS",
      "description": "BEYZA YAZGAN Plays BACH'S COMPLETE GOLDBERG VARIATIONS    Experience Bach’s transcendent masterpiece, “Goldberg Variations”brought to life by award-winning Turkish pianist and composer Beyza Yazgan in an intimate space.  The Goldberg Variations (c. 1741) stand as one of the most profound and technically brilliant works in the keyboard repertoire. The work consists of an aria and 30 variations, showcasing Bach’s unparalleled mastery of counterpoint, harmony, and keyboard technique.     The story goes that Bach composed the Goldberg Variations for Count Hermann Karl von Keyserling, who requested pieces that were “soothing and cheerful” This was so his young harpsichordist, Johann Gottlieb Goldberg, could perform them to comfort him during his restless evenings as he struggled with his condition. The Count would call upon young Goldberg to play the variations, finding healing and transformative power in the music.     Beyza Yazgan is a Turkish pianist, composer, and multidisciplinary artist. She holds a doctorate in piano performance from Mimar Sinan Fine Arts University in Istanbul (a year in Chopin Academy in Warsaw). After moving to New York in 2016, she earned a Professional Studies diploma from Mannes School of Music, where she received the Josef Fidelman Contemporary  Music Performance Award.  She has performed in diverse locations ranging from traditional venues such as Weill Recital Hall in Carnegie Hall to ancient caves in Turkey. After winning first prize at the 8th Metropolitan International Piano Competition, she produced her debut album, To Anatolia:  Selections from the Turkish Five, released by Bridge Records in 2021. Her first album of original compositions, Human Cocoon, was released in July 2024 and selected as The Guardian’s “Contemporary album of the month     “Even at her most artless and unaffected, she can wrench emotion out of simplicity.” — The Guardian  www.beyzayazgan.com      $20 suggested -  Donate online now or in person that day.&nbsp;"
    },
    {
      "image": "https://viewcy-heroku-production.s3.amazonaws.com/courses/featured_images/000/017/856/cover/Stephan_Crump__nathanjamesleatherman.jpg?1749070979",
      "eventDate": "Wed,  Sep 24 2025",
      "startTime": "Wed,  Sep 24 2025",
      "endTime": "Wed,  Sep 24 2025",
      "title": "STEPHAN CRUMP - Passerine",
      "description": "Stephan Crump    - Passerine  Kenny Warren  • trumpet  David Leon  • alto saxophone, alto flute  Ches Smith  • percussion  Stephan Crump  • acoustic bass  The Memphis-bred, Brooklyn-based bassist/composer considers nests with an extraordinary new quartet.  “As a bassist and composer, Mr. Crump avoids obvious routes but manages never to lose his way” -   The New York Times       $20 suggested Donate here in advance or in person during the performance"
    },
    {
      "image": "https://viewcy-heroku-production.s3.amazonaws.com/courses/featured_images/000/016/753/cover/FOUR_BAGS.jpg?1743281073",
      "eventDate": "Sat,  Oct 04 2025",
      "startTime": "Sat,  Oct 04 2025",
      "endTime": "Sat,  Oct 04 2025",
      "title": "THE FOUR BAGS",
      "description": "THE FOUR BAGS   Brian Drye  -Trombone  Jacob Garchik  -Accordion  Sean Moran  -Guitar  Mike McGinnis  -Woodwinds     The Four Bags.    A clarinet, an accordion, a guitar, and a trombone walk into a bar....What came out was a Brooklyn supergroup that's difficult to define but easy to enjoy. The Four Bags' dangerous chamber music will thrill and delight fans of the Kronos Quartet, Bang On A Can, Ethel, and Bill Frisell. Their outrageous new waltz project is the latest in a career that includes forays into Persian Classical Music, death metal, electro pop,and Chopin.  \"Exuberant, virtuosic, and light-spirited...The Four Bags make smart music with a quiet joyful intensity” -The New Republic“  --    $20     Pay now online or that night in person"
    },
    {
      "image": "https://viewcy-heroku-production.s3.amazonaws.com/courses/featured_images/000/016/483/cover/2824_Mat_Maneri_Lucian_Ban_PF1.jpg?1742144250",
      "eventDate": "Sat,  Oct 11 2025",
      "startTime": "Sat,  Oct 11 2025",
      "endTime": "Sat,  Oct 11 2025",
      "title": "Lucian Ban and Mat Maneri: TRANSYLVANIAN DANCE",
      "description": "TRANSYLVANIAN DANCE      When Romanian-born pianist   Lucian Ban   and Grammy-nominated violinist   Mat Maneri   joined up for a concert in an opera house in Lucian's hometown of Targu Mures in the middle of Romania's Transylvania region, the music was, as Jazz Times puts it, “as close as it gets to Goth jazz\" Released in 2013 as a live album by ECM Records, the Transylvanian Concert has won critical acclaim on both sides of the Atlantic and has spawned several tours.   Their follow up album,  Transylvanian Dance,  is also being released by ECM.   8pm   $20 Tickets"
    },
    {
      "image": "https://viewcy-heroku-production.s3.amazonaws.com/courses/featured_images/000/017/500/cover/Dana_Kurtz.jpg?1747427681",
      "eventDate": "Mon,  Oct 13 2025",
      "startTime": "Mon,  Oct 13 2025",
      "endTime": "Mon,  Oct 13 2025",
      "title": "DAYNA KURTZ",
      "description": "Over the past decade, the New Jersey born, now New Orleans resident   Dayna Kurtz   -  a vocalist. writer. musician and producer - has been bestowed with many awards and praises, including being named the Female Songwriter of the Year by the National Academy of Songwriters. Norah Jones and Bonnie Raitt have raved about her in interviews, and she’s toured as an opening act for the likes of Elvis Costello, Richard Thompson, Mavis Staples, Rufus Wainwright, B.B. King, Dr. John, Richie Havens, Keren Ann, Chris Whitley, and the Blind Boys of Alabama.&nbsp; Her last studio record, “Rise and Fall” was nominated for 5 Offbeat Magazine Awards.     7pm    $20 . Pay now online or in person that day. '"
    },
    {
      "image": "https://viewcy-heroku-production.s3.amazonaws.com/courses/featured_images/000/017/738/cover/Los_cumplean_CC_83os_viewcy.jpg?1748546545",
      "eventDate": "Fri,  Nov 14 2025",
      "startTime": "Fri,  Nov 14 2025",
      "endTime": "Fri,  Nov 14 2025",
      "title": "TROPICAL VORTEX presents: LOS CUMPLEAÑOS",
      "description": "LOS CUMPLEANOS     Los Cumpleaños play a psychedelic take on classic Colombian Cumbia, Porro, Son Caribeño, Salsa Criolla and Bullerengue. The band has the playfulness of an experimental group and the energy of a punk rock band. They mix new wave synths &amp; retro organ sounds with effect-laden trombone and trumpet as well as a three piece percussion section. Cumpleaños features virtuoso percussionist/vocalist  Nestor Gomez  from Barranquilla, Colombia,  Lautaro Burgos  from Chaco, Argentina on drumset as well as  Eric Lane  on Keyboards and  Alex Asher  on Trombone from the USA. The members of Los Cumpleaños have played with a variety of notable artists including: Anibal Velazquez, Lizandro Meza, Juan Piña, Alfredo Gutierrez, MAKU Soundsystem, Beyoncé, Joan as Police Woman and People's Champ       $20 suggested  Pay now online or in person that night.&nbsp;"
    },
    {
      "image": "https://viewcy-heroku-production.s3.amazonaws.com/courses/featured_images/000/016/754/cover/FOUR_BAGS.jpg?1743281101",
      "eventDate": "Sat,  Dec 13 2025",
      "startTime": "Sat,  Dec 13 2025",
      "endTime": "Sat,  Dec 13 2025",
      "title": "THE FOUR BAGS",
      "description": "THE FOUR BAGS   Brian Drye  -Trombone  Jacob Garchik  -Accordion  Sean Moran  -Guitar  Mike McGinnis  -Woodwinds     The Four Bags.    A clarinet, an accordion, a guitar, and a trombone walk into a bar....What came out was a Brooklyn supergroup that's difficult to define but easy to enjoy. The Four Bags' dangerous chamber music will thrill and delight fans of the Kronos Quartet, Bang On A Can, Ethel, and Bill Frisell. Their outrageous new waltz project is the latest in a career that includes forays into Persian Classical Music, death metal, electro pop,and Chopin.  \"Exuberant, virtuosic, and light-spirited...The Four Bags make smart music with a quiet joyful intensity” -The New Republic“  --    $20     Pay now online or that night in person"
    }
  ]
}