{
  "venue_name": "National Sawdust",
  "extraction_timestamp": "20250616_161716",
  "data": [
    {
      "eventDate": "June 18, 2025",
      "startTime": "June 18, 2025",
      "endTime": "June 18, 2025",
      "title": "Isaiah Barr, David Frazier Jr. and William Parker at \"Sugar, Sugar!\" Festival in Domino Park",
      "description": "National Sawdust is thrilled to partner with Domino Park's inaugural Sugar, Sugar! festival for a night of music set against unparalleled views of the Manhattan skyline. Join us at our neighborhood park for a twilight jazz performance of \"Back to Nature\" featuring Isaiah Barr, David Frazier Jr. and William Parker. Admission is free with reservations."
    },
    {
      "eventDate": "June 19, 2025",
      "startTime": "June 19, 2025",
      "endTime": "June 19, 2025",
      "title": "The Messenger",
      "description": "The Messenger follows a community of seekers whose leader has gone missing. They have always lived in harmony with the land, their ancestry, and beliefs. What will they do in his absence? In this fusion of classical, jazz and new music, the community sets out to answer this very question."
    },
    {
      "eventDate": "June 20, 2025",
      "startTime": "June 20, 2025",
      "endTime": "June 20, 2025",
      "title": "Blue Note Jazz Festival Presents: Babehoven with special guest Raavi",
      "description": "Babehoven is a band fronted by singer-songwriter Maya Bon and collaborator Ryan Albert in Hudson, NY. Their new album 'Water's Here In You' is available everywhere on April 26 via Double Double Whammy."
    },
    {
      "eventDate": "June 21, 2025",
      "startTime": "June 21, 2025",
      "endTime": "June 21, 2025",
      "title": "Blue Note Jazz Festival Presents: Mohini Dey",
      "description": "Mohini Dey is a 28 year old Indian renowned bass guitarist, arranger, producer & vocalist who has gained international recognition for her extraordinary talent and versatility. With her unique style and impeccable technique, she has collaborated with numerous renowned artists and performed on prestigious stages around the world."
    },
    {
      "eventDate": "June 21, 2025",
      "startTime": "June 21, 2025",
      "endTime": "June 21, 2025",
      "title": "Blue Note Jazz Festival Presents: Mohini Dey",
      "description": "Mohini Dey is a 28 year old Indian renowned bass guitarist, arranger, producer & vocalist who has gained international recognition for her extraordinary talent and versatility. With her unique style and impeccable technique, she has collaborated with numerous renowned artists and performed on prestigious stages around the world."
    },
    {
      "eventDate": "September 12, 2025",
      "startTime": "September 12, 2025",
      "endTime": "September 12, 2025",
      "title": "Rachika Nayar and Nina Keith Present Disiniblud",
      "description": "Nina Keith and Rachika Nayar were drawn to one another like mirror images or two sisters reuniting after a lifetime of separation. Four years ago, the artists met in Brooklyn's two-block–by–two-block Maria Hernandez Park after fan-girling each other’s music online. Dishing about messy post-lockdown long-distance lesbianism, heartfelt investments in Buddhist and Hindu philosophies, and a shared high-school love of the Eternal Sunshine OST, the two found their surface similarities gesturing toward a deeper shared existential worldview. Presented in partnership with AdHoc."
    },
    {
      "eventDate": "September 16, 2025",
      "startTime": "September 16, 2025",
      "endTime": "September 16, 2025",
      "title": "Devendra Banhart (Solo) with support from Kath Bloom",
      "description": "Devendra Banhart (b. 1980, Houston, Texas) lives and works in Los Angeles. An internationally renowned musician considered a pioneer of the “freak folk” and “New Weird America” movements, Banhart has toured, performed, and collaborated with Vashti Bunyan, Yoko Ono, Os Mutantes, the Swans, ANOHNI, Caetano Veloso, and Beck, amongst many others. His musical work has always existed symbiotically alongside his pursuits in the other fine arts."
    },
    {
      "eventDate": "September 17, 2025",
      "startTime": "September 17, 2025",
      "endTime": "September 17, 2025",
      "title": "Devendra Banhart (Solo) with support from Kath Bloom",
      "description": "Devendra Banhart (b. 1980, Houston, Texas) lives and works in Los Angeles. An internationally renowned musician considered a pioneer of the “freak folk” and “New Weird America” movements, Banhart has toured, performed, and collaborated with Vashti Bunyan, Yoko Ono, Os Mutantes, the Swans, ANOHNI, Caetano Veloso, and Beck, amongst many others. His musical work has always existed symbiotically alongside his pursuits in the other fine arts."
    },
    {
      "eventDate": "September 26, 2025",
      "startTime": "September 26, 2025",
      "endTime": "September 26, 2025",
      "title": "Juan Wauters",
      "description": "After spending the majority of his adult life thus far in New York, Juan Wauters decides to revisit his native Montevideo, the culturally rich capital of Uruguay. Wauters explored the excitement of falling back in love with his birthplace on his subsequent record, 2023’s Wandering Rebel, but on his seventh studio album MVD LUV — due June 27 via Captured Tracks — Wauters doesn’t just introduce listeners to Montevideo; he invites them to feel at home within it. Having spent much of his career in the United States, Wauters has long carried the dual identity of immigrant and native son. With MVD LUV, a love letter to both his roots and his present, he set out to bridge those worlds by capturing the essence of Montevideo’s streets and communal spirit."
    },
    {
      "eventDate": "September 27, 2025",
      "startTime": "September 27, 2025",
      "endTime": "September 27, 2025",
      "title": "Zola Jesus",
      "description": "Zola Jesus aka Nika is an American born singer, songwriter and producer. Since 2008, she has released two EPs and seven (?) full-length albums majoratively on NY multi-decade tastemaker label Sacred Bones. Nika began training as an opera singer at the age of 10. She dismantled that training to deliver her breakthrough lo-fi record The Spoils in 2009, most of which she recorded as an undergrad in her dorm room at UW Madison."
    },
    {
      "eventDate": "September 27, 2025",
      "startTime": "September 27, 2025",
      "endTime": "September 27, 2025",
      "title": "Zola Jesus (Late Show)",
      "description": "Zola Jesus aka Nika is an American born singer, songwriter and producer. Since 2008, she has released two EPs and seven (?) full-length albums majoratively on NY multi-decade tastemaker label Sacred Bones. Nika began training as an opera singer at the age of 10. She dismantled that training to deliver her breakthrough lo-fi record The Spoils in 2009, most of which she recorded as an undergrad in her dorm room at UW Madison."
    },
    {
      "eventDate": "October 1, 2025",
      "startTime": "October 1, 2025",
      "endTime": "October 1, 2025",
      "title": "Evening With Elliot Moss",
      "description": "New York-based singer, songwriter, and producer Elliot Moss celebrates the tenth anniversary of his seminal, career-launching record with Highspeeds (Expanded – 10th Anniversary), due August 8th via Nettwerk. The expanded edition will feature new songs left off the original album and stripped-down reworks of fan-favorites that made Elliot a cult-favorite."
    }
  ]
}